[{"title":"Morgens im Stand-UpDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Was haben wir gemacht? Was kommt als nächstes? Gibt's Probleme? Diese Fragen stellen sich Programmierer gewissenhaft jeden Morgen. Allerdings ist das Problem natürlich übertragbar: wo es hingeht und was die Stolpersteine sind, das fragen sich auch Softwarearchitekten, Entscheider und Geldgeber, und nie war das Problem komplexer als in 2014. Kommen Sie zu dieser Keynote und werfen Sie mit Oliver Sturm einen Blick auf mögliche Antworten!","start":"2014-08-14T07:15:00Z","track":"","speaker":"Sturm, Oliver"},{"title":"Die Architektur der ASP.NET Web APIDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"ASP.NET Web API ist eine der jüngsten Ergänzungen des ASP.NET-Universums. Microsoft hat damit das fehlende Puzzlestück geliefert, um moderne und flexible Web-Schnittstellen auf Basis der ASP.NET-Plattform zu entwickeln. In dieser Session nehmen wir den Aufbau der Web API genau unter die Lupe und untersuchen ihre Bestandteile. Wir betrachten die Architektur und die verschiedenen Hosting-Möglichkeiten, die die ASP.NET Web API Ihnen anbietet. Weiterhin vollziehen wir die Abarbeitung eingehender HTTP-Requests nach und verfolgen ihren Weg durch die Request-Pipeline. Schlussendlich werfen wir einen Blick auf die Konfigurationsmöglichkeiten und Erweiterungspunkte der Web API. Am Ende dieser Session verfügen Sie über ein tiefergehendes Verständnis des Aufbaus der ASP.NET Web API und wissen über die wichtigsten Anpassungsmöglichkeiten Bescheid.","start":"2014-08-14T08:30:00Z","track":"Webentwicklung","speaker":"Schulz, Marius"},{"title":"Visual Studio 2013 - Ein Überblick Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Bis zur Version 2012 hat Microsoft alle zwei Jahre die neuste Version der wohl mächtigsten und umfangreichsten Entwicklungsumgebung überhaupt auf den Markt gebracht. Nun erhöht Microsoft das Tempo etwas und verkürzt die Releasezeit auf nur ein Jahr. Damit steht uns in diesem Jahr die Version 2013 mit zahlreichen Neuerungen und Verbesserungen ins Haus. David Tielke schaut sich zusammen mit Ihnen in dieser Session alle wichtigen Bereiche der Versionen 2012 und 2013 an und zeigt Ihnen, wie Sie diese richtig einsetzen.","start":"2014-08-14T08:30:00Z","track":"Visual Studio","speaker":"Tielke, David"},{"title":"Einführung in die Windows Azure PlattformDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Der Einzug von Cloud Computing in der tägliche Arbeit gewinnt weiter an Bedeutung. Doch was steckt eigentlich hinter dem Begriff Cloud Computing? Was muss ich als Softwareentwickler dabei beachten? Dieser Vortrag liefert einen Überblick über die Konzepte und gängigen Dienste der Windows Azure Plattform, wie beispielsweise Web Sites, Cloud Services, Storage, SQL Database, Service Bus und Virtual Maschines. Kombiniert mit einigen Code Beispielen und Erfahrungen aus der Praxis, wird so der Einstieg in die Softwareentwicklung mit Windows Azure vereinfacht.","start":"2014-08-14T08:30:00Z","track":"Azure","speaker":"Dittmann, Sascha"},{"title":"Continuous Delivery und Deployment in der PraxisDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Eine Software nicht mehr nur zweimal pro Jahr, sondern beispielsweise zweimal pro Woche für den produktiven Einsatz zu veröffentlichen, hat ihren Reiz. Doch die Umsetzung von Continuous Delivery (Lizenz) und Continuous Deployment (SaaS) in die Praxis hat ihre Tücken, denn es müssen Software-Versionen für den Produktiveinsatz veröffentlicht werden, die unfertige Features - vom Prototyp- bis zum Beta-Stadium - enthalten. Doch mit ausreichend Vorbereitung kann es gelingen, sowohl Software-Nutzer, als auch deren Entwickler glücklich zu machen: Die Nutzer, weil sie schneller von neuer Funktionalität profitieren, und die Entwickler, weil das parallele Pflegen mehrerer Zweige und schmerzhafte Merge-Prozesse von Release Branches mit dem Main Trunk entfallen. Diese Session räumt mit Mythen auf und stellt Muster vor für den Entwicklungsprozess, Test-Verfahren und -Abläufe, das Vorgehen für Build und Deployment sowie den Einsatz von Tools, um Continuous Delivery & Deployment erfolgreich umzusetzen.","start":"2014-08-14T08:30:00Z","track":"ALM","speaker":"Aschoff, Martin"},{"title":"Das Märchen vom agilen ArchitektenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Softwarearchitektur ist ein Kind der 90er, UML-Diagramme kommen gleich nach Höhlenmalerei. Braucht ein Projekt mit zeitgemäßem Vorgehen das heute noch? Viele Webprojekte beantworten diese Frage für sich mit „nein“ und sind erfolgreich. Haben sie einfach nur Glück gehabt? Einige Projekte scheitern dagegen kläglich. Hätte ein Mehraufwand für Softwarearchitektur hier einen Benefit gehabt? Wie sähe dieser aus? Und wie sieht moderne Architekturarbeit überhaupt aus? Welche Praktiken sind zu einem agilen Vorgehen kompatibel? In diesem Vortrag sortiere ich Projektsituationen zwischen verunfallter und wirkungsvoller Softwarearchitektur ein. Ich zeige am Beispiel von Webprojekten, welchen Einfluss Technologien, Vorgehen und weitere Faktoren auf das richtige Maß an Softwarearchitektur haben. Verblüffend oft ist „wenig“ genug. Sie lernen hier, wo „nichts“ zu wenig wäre. Und wie Sie Ihr „gerade genug“ finden.","start":"2014-08-14T08:30:00Z","track":"Webarchitekturen","speaker":"Zörner, Stefan"},{"title":"Code-Qualität trotz JavaScriptDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Der Hype um JavaScript ist schon wieder vorbei, die Sprache hat sich etabliert und meldet Ansprüche als Plattform für unternehmenskritische Applikationen an und erobert zunehmend das Server- und Backend-Umfeld. Ein Plus ist die große Flexibilität und Freiheit: JavaScript verbindet funktionale, objekt-orientierte und imperative Programmierstile. Diese Freiheit trägt eine große Herausforderung für den praktischen Projekteinsatz. Der Vortrag zeigt, wie JavaScript im Projektalltag gebändigt werden kann. Durch produktive Tools messen wir die Qualität, zeigen Schwachstellen rechtzeitig auf und geben Tipps für die Behebung.","start":"2014-08-14T08:30:00Z","track":"JavaScript","speaker":"Köbler, NikoSpindler, Heiko"},{"title":"Android on Intel PlatformsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Intel engagiert sich seid mehreren Jahren in der Hard und Softwareentwicklung für Android Devices. Der Vortrag startet mit einem kurzen Überblick über die aktuelle und kommende Technik von Android Geräten mit Intel Inside. Der Schwerpunkt bildet ein Überblick über die Entwicklungswerkzeuge die Intel für Android aber auch für die HTML5 Entwicklung anbietet. Anhand von Beispielen wird unter anderem gezeigt wie der Batterieverbrauch einer Anwendung analysiert und optimiert werden kann und wie man das Laufzeitverhalten von Anwendungen analysiert die sowohl in Java als auch in C++ mit dem Android NDK entwickelt wurden.","start":"2014-08-14T08:30:00Z","track":"Android","speaker":"Weggerle, Alexander"},{"title":"SinglePageApplications mit Ember.jsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Als Architekten stehen wir vor dem Problem, dass unser in die Jahre gekommenes Altsystem den Anforderung an Usability und Performanz nicht mehr gewachsen ist. Gleichzeitig versprechen Single Page Application (SPA) Frameworks wie Ember.JS die effiziente Entwicklung von Webapplikationen auf dem neusten Stand der Technik.Dieser Vortrag ist ein Rückblick auf ein Jahr SPA-Entwicklung mit Ember im Rahmen einer Systemerneuerung. Wir beleuchten unsere Technologieauswahl sowie unsere Erfahrungen aus der täglichen Arbeit mit Ember und dem dazugehörigen Technologiestack.","start":"2014-08-14T08:30:00Z","track":"Web-Frameworks","speaker":"Ringler, ChristianRieger, Robert"},{"title":"CoreBluetooth in iOS 7Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mit CoreBluetooth können wir unsere Apps schnell und einfach mit Bluetooth LE Geräten verbinden. In iOS 7 sind interessante Neuerungen wie Hintergrundausführung und iBeacon dazugekommen. Diese sehr codelastige Session zeigt, wie wir CoreBluetooth zum Laufen bringen, und welche Stolpersteine wir dabei beachten müssen.","start":"2014-08-14T08:30:00Z","track":"iOS","speaker":"Freese, Tammo"},{"title":"Architecting the Cloud Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Public Cloud Plattformen wie Windows Azure oder Amazon AWS machen es immer leichter existierende Applikationen oder Dienste in der Cloud zu betreiben und für eine große Anzahl an Usern zur Verfügung zu stellen. Ausfallsichere und skalierbare Anwendungen stellen jedoch besondere Anforderungen an Architektur und Entwicklung. Der Vortrag liefert Architekturbeispiele aus der Praxis und vermittelt die Erfahrungen und Learnings aus realen Kundenprojekten. Anhand von praktischen Beispielen wird aufgezeigt, welche Windows Azure Services zur Umsetzung dieser Architekturen verwendet werden können.","start":"2014-08-14T09:45:00Z","track":"Architektur","speaker":"Eichenseer, Robert"},{"title":"Rapid Application Development – nur Spielerei? Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Bereits seit den 70er Jahren hat sich Rapid Application Development (RAD) als Prozess in der Softwareentwicklung etabliert und dennoch genießen RAD Tools häufig unter professionellen Softwareentwicklern kein besonders großes Ansehen. Dennoch hat Microsoft mit Project Siena gerade eine weitere Möglichkeit zur schnellen Anwendungsentwicklung als Beta bereitgestellt. Was macht Rapid Application Development also so spannend, wo steckt das Potential von Visual Studio LightSwitch oder Project Siena und was ist damit heute schon möglich – damit beschäftigt sich diese Session.","start":"2014-08-14T09:45:00Z","track":"Visual Studio","speaker":"Klein, Constantin"},{"title":"Daten-Backends in der Cloud und deren IntegrationDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Apps sind dann erfolgreich, wenn diese eine gegebene Problemstellung perfekt lösen, genial aussehen und fehlerfrei sind. Dies sind für Entwickler keine leichten Anforderungen! Wenn Sie zudem ein Daten-Backend benötigen, können die Aufgaben einem leicht über den Kopf wachsen und Sie müssen abwägen, wofür Sie Ihre kostbare Zeit aufwenden. In die App, die so wie sie ist von jedem Nutzer nach wenigen Sekunden bewertet wird oder in das Backend, dass unsichtbar im Hintergrund schlummert? Dieser Vortrag zeigt Ihnen die Vorteile der Windows Azure Mobile Services auf, mit sehr wenig Aufwand ein stabiles Daten-Backend zu entwickeln, damit Sie sich weiterhin voll auf die Entwicklung Ihrer App fokussieren können. Damit Sie sehen, dass dies Realität ist, wird alles am Beispiel einer Windows 8 App demonstriert.","start":"2014-08-14T09:45:00Z","track":"Azure","speaker":"Kirchner, Peter"},{"title":"OWIN - der Microsoft Web Stack erfindet sich neuDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"ASP.NET ist nun bereits über 10 Jahre alt - was ist also der nächste Schritt auf dem Microsoft Web Stack? Das \"Open Web Interface for .NET\" begann als eine kleine Diskussionsrunde und bildet nun mehr und mehr die Grundlage für eine wesentlich flexiblere und leichtgewichtigere Entwicklungsplattform. Eine WebApi ohne IIS hosten? Kein Problem. Verschiedene Frameworks kombinieren und Abhängigkeiten zwischen Server und Frameworks auflösen? Das ist das Ziel von OWIN. In dem Vortag möchte ich die Grundlagen von OWIN zeigen, den aktuellen Stand der Technik und das man vermutlich schon OWIN eingesetzt hat ohne das man es überhaupt genau wusste.","start":"2014-08-14T09:45:00Z","track":"Webentwicklung","speaker":"Mühsig, Robert"},{"title":"Erfolgreiche RewritesDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Viele Applikationen sind über Jahre erfolgreich gewesen und haben jede Änderung mitgemacht - und sind in Folge unwartbar geworden, und entsprechen längst nicht mehr aktuellen Standards. Doch um weiter am Markt zu bestehen muss man schnell agieren können, also braucht es einen Rewrite auf ein modernes Framework. Aber Rewrites schlagen häufig durch jede Deadline oder ganz fehl, und während des Rewrites muss man auf die Konkurrenz reagieren können. Die Lösung ist ein Continuous Rewrite, der mit der alten Lösung beginnt und bei kontinuierlicher Nutzung mit der neuen Lösung endet. Wir stellen Methoden und Praxiserfahrungen vor.","start":"2014-08-14T09:45:00Z","track":"ALM","speaker":"Hartmann, Johann-Peter"},{"title":"JavaScript Debugging und ProfilingDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die Applikation ist fertiggestellt und live. Jetzt geht es daran, die Fehler, die sich in die Applikation geschlichen haben, möglichst schnell zu finden und zu beheben. Wie aber findet man nicht offensichtliche Fehler in einer Unmenge von JavaScript-Quellcode? Dieser Frage widmet sich dieser Vortrag und zeigt Ihnen unter anderem, wie Sie den JavaScript Debugger in Ihrem Browser benutzen, wie Sie auch aus Ihrer Entwicklungsumgebung heraus debuggen können oder wie Sie Performanceengpässen auf die Schliche kommen können.","start":"2014-08-14T09:45:00Z","track":"JavaScript","speaker":"Springer, Sebastian"},{"title":"REST und RESTful HTTP: Was es ist – und was nichtDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"REST gehört mittlerweile zum guten Ton: Was auch immer wir ansehen, ob Produkt, Dienst oder Framework: Überall wimmelt es nur so von Dingen, die behaupten, „RESTful“ zu sein. Aber wie immer, wenn etwas gerade in Mode ist, handelt es sich dabei um Etikettenschwindel. In diesem Vortrag beginnen wir mit einer pragmatischen Einführung in die Grundlagen von REST, des Architekturstils des Webs, bevor wir den größten Teil unserer Zeit damit verbringen, uns die häufigsten Irrtümer und Missverständnisse rund um das Thema anzusehen.","start":"2014-08-14T09:45:00Z","track":"Webarchitekturen","speaker":"Tilkov, Stefan"},{"title":"Android Builds automatisierenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Auf der GoogleIO 2013 wurde bekannt gegeben, dass das Android Build System von Ant auf Gradle umgestellt wird. Dieses neue Build System bringt viele Vorteile gegenüber Ant, aber der Umstieg von alten Projekten sowie der Neueinstieg mit neuen Projekten ist auch nicht immer ganz einfach. Der erste Teil des Vortrags wird zeigen wie ein einzelner Entwickler von Gradle profitieren kann. Es werden die Grundlagen von Gradle aufgezeigt, wie bestehende Eclipse Projekte importiert werden können und wie sich Android-Builds mit Build-Types und Productflavors Android-Builds besser automatisieren lassen. Der zweite Teil des Vortrags erzählt die War Story vom Automatisieren der Android Builds bei Kupferwerk. Viele einzelne Kundenprojekte sollen automatisch gebaut getestet und ausgeliefert werden. Je nach Alter basieren diese Projekte auf unterschiedlichen Bibliotheken, die ebenfalls vom Buildserver gebaut werden.","start":"2014-08-14T09:45:00Z","track":"Android","speaker":"Leidgens, Janusz"},{"title":"DatenvisualisierungDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"In den letzten Jahren haben verschiedene Technologien und Themenfelder stark an Bedeutung zugenommen: Big Data, Datenjournalismus, Cloud Computing, Mobile Computing, usw. Alle diese Felder haben eine Facette gemeinsam: die Visualisierung von Daten. Wie lassen sich die Tonnen von Daten aus dem Data Store oder der Cloud sinnvoll darstellen? Wie kann man schier endlose Tabellen aufbereiten, um auf den ersten Blick die Botschaft zu erkennen? Wie kann man komplexe Grafiken für unterschiedlichste Anforderungen erstellen? Auf diese und weitere Fragen hält die Session eine Antwort parat und soll mittels ausgesuchter Tools und Frameworks einen Einblick in die Welt der Datenvisualisierung geben.","start":"2014-08-14T09:45:00Z","track":"Web-Frameworks","speaker":"Walter, Martin"},{"title":"iBeacons allüberall – und in der PraxisDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"iBeacon wurde als iOS 7-Neuerung auf der WWDC 2013 vorgestellt und blieb für die meisten vergleichsweise unauffällig. Dabei wird diese Technologie uns zukünftig vielfach begegnen und unser aller Leben in vielfacher Hinsicht verändern. Ist iBeacon besser als NFC? Ist iBeacon eine Art GPS für drinnen? Was kann ich selber denn damit machen? Wer Näheres wissen und von Anfang dabei sein möchte, erfährt in dieser Session neben den Grundlagen vor allem auch nützliche Anwendungen und konkrete Beispiele – und warum iBeacon tatsächlich mehr ist als nur mal wieder ein neues Buzz Word.","start":"2014-08-14T09:45:00Z","track":"iOS","speaker":"Wessel, Ivo"},{"title":"Software-komponentenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Was in anderen Industriezweigen schon seit Jahrzehnten gängige Praxis ist, wird in der Softwareentwicklung leider bis heute nur selten und wenn dann meist mangelhaft umgesetzt: Die Entwicklung von Systemen in Komponenten. Dabei ist die Lösung so simpel wie genial: Die Software wird in kleine Bausteine zerteilt, die keine harten Abhängigkeiten haben und dabei ohne Beschränkungen wiederverwendbar, testbar, austauschbar und skalierbar sind. David Tielke zeigt Ihnen in dieser Session wie solche Komponenten in objektorientierten Sprachen umgesetzt werden und zeigt in einer C#-Anwendung eine praktische Anwendung sowie einige Beispiele dieser Architekturform aus seinem Berateralltag.","start":"2014-08-14T11:45:00Z","track":"Architektur","speaker":"Tielke, David"},{"title":"7 Jahre Visual Studio TFS – Tipps & AusblickDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Den Visual Studio Team Foundation Server, das Herzstück der Microsoft ALM-Plattform, gibt es nun schon seit 2006 auf dem Markt. Die meisten Unternehmen nutzen jedoch nicht annähernd die vielen Möglichkeiten aus, die von Version zu Version und auch in den Updates (4 x im Jahr) hinzugekommen sind. Diese Session gibt Antworten auf: Was der TFS – Stand: heute - alles kann, welche Highlights man keinesfalls verpassen sollte, ausgewählte Tipps & Best Practices, die sich im Laufe der Jahre angesammelt haben, sowie einen Ausblick auf die zukünftige Entwicklung. Somit ist diese Session für Einsteiger, Umsteiger und bestehende Nutzer zu empfehlen.","start":"2014-08-14T11:45:00Z","track":"Visual Studio","speaker":"Loje, Neno"},{"title":"Enterprise-Webanwendungen mit Ext JS / EXT.NETDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Sicher kennen Sie leichtgewichtige UI bzw. MVVM-Frameworks wie Knockout oder AngularJS. Doch was bietet die alternative Seite? Welche Schätze gibt es in puren 1,42 MB JavaScript-Quellcode zu entdecken? Lernen Sie in diesem Workshop das universelle Framework Ext JS und den .NET Wrapper EXT.NET kennen. Johannes Hoppe erläutert die konsequente Umsetzung bekannter Patterns im ExtJS Core. Sehen Sie, wie man mit über 100 Komponenten eine stringente Oberfläche gestalten kann. Dieser Workshop behandelt im Detail die flexible Client-Server Kommunikation über \"Proxys\" & \"Stores\", die Möglichkeiten zum Theming und Layout-Management sowie die Entwicklung eigener Plugins und Komponenten. Es wird ASP.NET MVC, Razor und das Framework EXT.NET (welches Ext JS als Nuget-Paket zur Verfügung stellt) verwendet. Das Setup basiert somit auf .NET, die eigentlich Programmierung geschieht jedoch zum Großteil direkt in JavaScript. Der Workshop richtet sich an alle Teilnehmer, welche mit HTML5 und JS vertraut sind.","start":"2014-08-14T11:45:00Z","track":"Webentwicklung","speaker":"Hoppe, Johannes"},{"title":"Debugging im Zeichen der CloudDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Der Erste Cloud Service ist mit Hilfe von Visual Studio sehr schnell entwickelt und in Windows Azure zur Verfügung gestellt. Auch das Debuggen in der lokalen Entwicklungsumgebung ist altbekannt und stellt vor keine besondere Herausforderung. Sobald es jedoch zu einer Fehlermeldung im Live-Betrieb kommt ist guter Rat teuer. Wie kann das Problem eingegrenzt und behoben werden? Auf welchen der möglicherweise vielen Instanzen eines Cloud Services kam es zu dem Fehler und warum tritt der Fehler nur hier auf? Der Vortrag zeigt anhand von Beispielen Methoden und Vorgehensweisen auf, wie fehlerhafter Code bzw. Probleme im Live Betrieb mit Hilfe von Windows Azure Diagnostics oder Profiling identifiziert und im post-mortem bzw. live-debugging des Cloudservice gefixt werden können.","start":"2014-08-14T11:45:00Z","track":"Azure","speaker":"Eichenseer, Robert"},{"title":"'Triple-E' class Continuous DeliveryDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Bei Maersk Line werden nicht nur die weltweit größten, umweltfreundlichsten Schiffe der 'Triple-E' Klasse gebaut. Continuous Integration und Delivery wird in vergleichbarer Größenordnung praktiziert. Unter Nutzung von Hudson, Maven und Tools wie Kokki (ähnlich Chef, Python-basierend) sowie Multiconf, ebenfalls Python-basierendes Tool, dessen Autor bei Maersk DevOps arbeitet. Die Session gewährt einen Überblick des Application Lifecycle Management multipler Umgebungen und Projektphasen in einem verteilten, stark heterogenen Umfeld, sonst wohl nur bei großen Anbietern von Public Clouds wie Amazon oder Google zu finden. Planung aller Aufgaben und \"Sprints\" folgt Agilen Prinzipien. Gesteuert durch Systeme wie TeamConcert oder FocalPoint. Sowohl Git als auch SVN zur Versionierung. Offshore Partner stellen u.A. durch Zeitzonen von Hawaii bis Hong Kong oder Singapur zu eine logistische Herausforderung dar, die jener der 'Triple-E' Schiffsklasse und Maersk Flotte selbst um Nichts nachsteht.","start":"2014-08-14T11:45:00Z","track":"ALM","speaker":"Keil, Werner"},{"title":"Prinzipien für Skalierbare ArchitekturenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Im agilen Umfeld werden Architekturprinzipien wie SOLID und DRY benötigt, um flexibel auf neue Anforderungen zu reagieren. SOLID sorgt für Entkopplung der Komponenten und DRY (Don’t repeat yourself) bedeutet, Redundanzen zu vermeiden. Bei der Entwicklung großer Produkte arbeiten mehrere Teams parallel an der Umsetzung. Dies setzt eine entsprechend skalierbare Architektur voraus, bei der sich Teams über Architekturentscheidungen austauschen müssen. Die resultierenden Kommunikationskosten führen zu einer anderen Gewichtung altbekannter Architekturprinzipien. Gilt vielleicht sogar WET (Write Everthing Twice) statt DRY? In diesem Vortrag stellen wir vor, wie sich die Bedeutung der Prinzipien für eine skalierbare Architektur im Multi-Team-Umfeld ändert. Wir diskutieren nicht nur die Probleme, die dabei auftreten können, sondern bieten gleich die passenden Lösungsstrategien. Dadurch wird auch langfristig eine Architektur in einem Multi-Projekt mit mehreren Teams agil möglich.","start":"2014-08-14T11:45:00Z","track":"Webarchitekturen","speaker":"Havenstein, AndreasGünther, Sven"},{"title":"Tools und Tipps für den modernen Frontend-WorkflowDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die Aufgaben in der Frontend-Entwicklung (HTML/CSS/JS) sind umfassender geworden. Ob nun Responsive Webdesign oder umfangreiche Javascript-Applikationen, überall gibt es neue Frameworks und Librarys. Hilfsmittel wie CSS-Präprozessoren sind zwar schon länger verfügbar, aber erst seit kurzem in den Workflow der Entwickler eingeflossen. Automatisierungstools wie Grunt oder Gulp unterstützen bei der wiederkehrenden Arbeit. Aber was ist eigentlich Bower, Yeoman oder Angular-JS und was braucht man um die täglichen Aufgaben effektiv zu lösen. Ein Session aus der Kategorie „Der Werkzeugkoffer des modernen Frontendlers\".","start":"2014-08-14T11:45:00Z","track":"Web-Frameworks","speaker":"Wolfermann, Sven"},{"title":"iOS meets Arduino - Electronics prototyping with iOSDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Apple's MFI program has long been a big obstacle when it comes to building custom accessories for iOS devices. Fortunately, those times are over! Within this talk we are going to take a closer look on how to interface iOS devices with open source electronics such as Arduino and Raspberry Pi. You will learn to send data via dock connector and lightning port, head phone jack, Bluetooth Low Energy, and WiFi. After this talk you will be ready to build your own accessories and integrate them into your App - without being member of Apple's MFI program!","start":"2014-08-14T11:45:00Z","track":"iOS","speaker":"Meder, Jens"},{"title":"Testing mit Robolectric und FEST in Android StudioDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Testgetriebene Entwicklung unter Android ist mit Bordmitteln nicht ohne Weiteres möglich. Die Ausführung dieser Tests muss immer mit einem Nachteil auf einem Device/Emulator erfolgen: Schlechte Performance und umständliche Einrichtung. Robolectric setzt hier an und führt die Tests in der Java Virtual Machine aus, ohne zwingenden Device oder Emulator. In Kombination mit FEST werden die Tests zudem semantisch klarer und sparen als Nebeneffekt auch deutlich Code ein.","start":"2014-08-14T11:45:00Z","track":"Android","speaker":"Güngören, Onur"},{"title":"JavaScript für .NET-EntwicklerDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Zugegeben: JavaScript ist am Markt angekommen. Doch JavaScript ist anders als C# - funktional, prototypbasiert und gedanklich an LISP angelehnt. Gerade deshalb wirkt sie auf .NET-Entwickler fremdartig und unbekannt. Vieles, was gleich aussieht, verhält sich anders: new, this & Co. lassen grüßen. In dieser Session stellt Tilman Börner Fragen zum Ein- und Umstieg, von leicht bis schwer, und Golo Roden gibt Antworten. Ziel der Session ist, einen praxisnahen Einblick in die Besonderheiten der Sprache JavaScript zu vermitteln.","start":"2014-08-14T11:45:00Z","track":"JavaScript","speaker":"Roden, GoloBörner, Tilman"},{"title":"Flexible verteilte Anwendungen mit Micro-Service Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Eine optimale Lösung eines Problems setzt sich aus der optimalen Lösung von  Teilproblemen zusammen. Entkopplung, Autonomie und Flexibilität verschiedener standardtiesierter und genau beschriebener Datendienste verbunden mittels Komposition ist dabei der Schlüssel zu flexiblen Anwendungsarchitekturen. Micro-Services-Architekturen machen nicht nur eine skalierbare, flexible und fehlertolerantes Anwendungsdesign und deren Entwicklung in Entwicklungsteams möglich, sondern erhöffnen durch ihren Platform- und sprachunabhängige Ansatz ein ideales Standardarchitekturmodel von morgen.","start":"2014-08-14T13:00:00Z","track":"Architektur","speaker":"Bild, Mike"},{"title":"Visual Studio 2013 - Produktiver werdenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Microsoft bietet mit Visual Studio 2013 eine der besten und mächtigsten Entwicklungsumgebungen an, mit allem was das Entwicklerherz höher schlagen lässt. Aber kaum jemand durchblickt die stetig gewachsene Menge an Funktionen und Erweiterungen, so dass oft viel Zeit und Energie verschwendet wird, um Aufgaben zu erledigen, die mit den entsprechenden Tools einem Bruchteil der Zeit erfordert hätten. Wir schauen uns in dieser Session einige dieser Tools an und zeigen, wie diese am besten angewendet werden.","start":"2014-08-14T13:00:00Z","track":"Visual Studio","speaker":"Tielke, David"},{"title":"Real Time Anbindung an SAP ERP Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Sehen Sie in dieser Session wie ein in SAP erfasster Datensatz in Echtzeit über SignalR an eine Web-Oberfläche gesendet wird. Anhand eines Praxisbeispiels wird gezeigt wie verschiedene Technologien in einer One ASP.NET Solution (MVC, WebForms und Ajax/HTML5 Controls von Telerik, SignalR, SOAP mit SAP RFC) kombiniert werden um in Echtzeit Daten an die Clients zu senden.","start":"2014-08-14T13:00:00Z","track":"Webentwicklung","speaker":"Barthels, RainerNeff, Otto"},{"title":"Connected WebDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Diese Session ist ein Rundflug über die nächste Technologiewelle rund um “Devices and Services”, die es möglich machen die verteilten Systeme auf eine neue Art und Weise zu konzipieren. Im Fokus stehen die neuen Architektur Patterns die sich durch Cloud und die steigende Anzahl von Clients  zwangläufig ergeben. Egal was Sie von \"Cloud\" halten, zeigen wir wie die neuen Anforderung und Technologien unsere Denkweise über verteilten Systeme ändern. Wenn Sie Architekt oder Entwickler sind, fragen Sie sich bestimmt, wie Services heute gebaut werden sollen? Z.B.  Services in JS oder auf Smart Phone gehostet. In dieser Demo-Powered Session zeigen wir die Services einer anderen Art. Technologien im Fokus: Windows Azure Service Bus, Windows Azure Service Bus for Windows Server, Windows Phone, Windows RT und HTML/Java Script.","start":"2014-08-14T13:00:00Z","track":"Azure","speaker":"Dobric, Damir"},{"title":"ALM konkretDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Einige Softwarehersteller schaffen es bereits, alle drei bis sechs Wochen neue Versionen zu releasen. Google Chrome und Microsofts Team Foundation Services sind nur zwei Beispiele. Aber wie gelingt es diesen Teams, ständig neue Features zu veröffentlichen, ohne das die Qualität leidet oder der Testaufwand durch die Decke schießt? Der Vortrag zeigt, wie sich agile Teams diesem Ziel Schritt für Schritt nähern können. Die ersten Etappen mit Codeverwaltung und Integration-Builds sind oftmals schon etabliert. Die nächsten Schritte bedürfen einer Erweiterung des Repertoires um Agile Prozesse, Branching-Konzepte und automatisierte Tests. Experten-Tipps für automatisiertes Deployment, Collaboration Tooling und Diagnose runden den Talk ab und inspirieren zu einem vollständigeren ALM.","start":"2014-08-14T13:00:00Z","track":"ALM","speaker":"Rölz, Sebastian"},{"title":"JavaScript im richtigen LebenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Für beinahe alle gängigen JavaScript-Frameworks und -Bibliotheken existieren Tutorials und Screencasts, die einem Entwickler einen schnellen Einstieg in das Thema erlauben. Doch dieser Einstieg allein reicht nicht aus. Welches Framework setzt man für welche Situation am besten ein? Und wie geht es nach dem Schnelleinstieg weiter? In diesem Vortrag erfahren Sie, welche Erfahrungen wir in zahlreichen Projekten gemacht haben. Die Bandbreite reicht dabei von kleinen Startup-Projekten, die innerhalb kürzester Zeit ihre Geschäftsidee überprüfen möchten, bis hin zu großen Projekten, die über mehrere Jahre hinweg maintained und weiterentwickelt werden.","start":"2014-08-14T13:00:00Z","track":"JavaScript","speaker":"Springer, Sebastian"},{"title":"Autos verkaufen mit CQRS und Event SourcingDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"CQRS ist ein großer Hype aber wer verwendet es wirklich? Was steckt überhaupt hinter CQRS und Event Sourcing? Was bedeutet es eigentlich mit CQRS zu arbeiten und welche Baustellen mache ich mir damit auf? Ist CQRS das Allheilmittel für meine Probleme? Was muss ich bei der Infrastruktur bedenken? Wie gehe ich mit Asynchronität um? Welchen Mehrwert schaffe ich mit CQRS? In dieser Session erklären wir nicht nur die Theorie sondern beantworten die Fragen anhand zweier konkreter Beispiele bei AutoScout24.","start":"2014-08-14T13:00:00Z","track":"Webarchitekturen","speaker":"Garbe, PhilippStechl, Marco"},{"title":"Bildbearbeitung für iOS und Android mit OpenCVDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Dieser Vortrag zeigt die Möglichkeiten, wie Bilder mit OpenCV bearbeitet werden können. Haben Sie sich schon immer gefragt, wie Sie Bilder in iOS und / oder Android bearbeiten und beeindruckende Effekte zu erzielen können, so sind Sie in diesem Vortrag genau richtig.","start":"2014-08-14T13:00:00Z","track":"Android","speaker":"Frieser, UweWondratschek, Ralf"},{"title":"Schnee von gestern - Was ist ein Event Store?Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"DDD, CQRS, EventSource - all das scheint angeblich ohne einen Event Store nicht auskommen. Gut, aber was ist ein Event Store? Was kann man damit anstellen? Wie kann man denn Events speichern? Diese Session beseitigt die Fragen und bringt den Event Store viel dichter an die klassischen Architekturen, als man meinen würde.","start":"2014-08-14T14:30:00Z","track":"Architektur","speaker":"Fellien, Jan"},{"title":"Modular iOS AppsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Apps sind schon lange nicht mehr so klein, wie sie vor einiger Zeit von Apple angedacht waren. In dieser Session zeige ich, wie man große Applikationen in logische Teile unterteilen kann und so die Komplexität gering hält. Zudem zeige ich, wie wir bei XING dieses Konzept umgesetzt haben und welche Learnings wir daraus gezogen haben.","start":"2014-08-14T13:00:00Z","track":"iOS","speaker":"Brauer, Piet"},{"title":"Visual Studio Online IDEDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mit den Monaco Tools bietet Microsoft eine IDE in der Cloud. Welche Development Szenarien damit addressiert werden können, und welche Features derzeit zur Verfügung stehen erfahren Sie in dieser Session. Die Monaco Tools eignen sich nicht nur als Editor sondern sind eine Ideale Ergänzung des Continous Intergration Ansatzes.  Sie erlauben das Entwickeln im Live Modus, sowie das Debugging der online Applikation aber auch das Deployment via DVCS.","start":"2014-08-14T14:30:00Z","track":"Visual Studio","speaker":"Boscolo, Patric"},{"title":"Eine moderne RESTful basierte Web-AnwendungDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mit ASP.NET adaptierte Microsoft das Vorgehen für die Erstellung von Web-Anwendungen von Visual Basic. Seit ASP.NET können somit Web-Anwendungen per Drag&Drop realisiert werden. Die gesamte Logik und Verarbeitung der Daten geschieht – wenn keine besondere Architektur vorgesehen wird – hinter Ereignisempfängern – mit den bekannten Nachteilen. Mit ASP.NET MVC wurde dann ein weiteres alternatives Framework für die Erstellung von Web-Anwendungen bereitgestellt. Durch die „eingebaute“ Architektur erfolgt automatisch eine Strukturierung gemäß SoC (Separation of Concerns). Basierend auf ASP.NET erfolgt nun die nächste Evolutionsstufe Web-basierter Anwendungen. Serverseitig werden Dienste bereitgestellt die von einem leichtgewichtigen HTML Client konsumiert werden können. Roundtrips vom Server werden somit weiter reduziert. Wie eine solche Anwendung aufgebaut werden kann, wird anhand eines praktischen Beispiels demonstriert.","start":"2014-08-14T14:30:00Z","track":"Webentwicklung","speaker":"Zhou, Marc André"},{"title":"Was ist neu in Windows Azure Mobile Services?Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Windows Azure Mobile Services hat sich bisher zur einen beliebten Technologie entwickelt, wenn es darum geht vor allem die Daten aus Cloud von mobilen Geräten zu konsumieren. Dieser Session fokussiert die neue Features und Best Practices, die vielmehr für Unternehmen interessant sein könnten. Technologien im Fokus: Windows Azure Mobile Services","start":"2014-08-14T14:30:00Z","track":"Azure","speaker":"Dobric, Damir"},{"title":"IT-Nearshoring/-Offshoring: SourcingstrategienDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Der Bundesverband Informationswirtschaft, Telekommunikation und neue Medien e.V. (BITKOM) vermeldete Ende Oktober 2013 in Deutschland 39.000 unbesetzte Stellen im IT-Sektor. Wie können Unternehmen in Anbetracht voller Auftragsbücher diese Lücke schließen?Eine nicht zuletzt vor dem Hintergrund des immer härter werdenden Kostendrucks sehr attraktive Lösung heißt: Auslagerung der Entwicklungstätigkeiten nach Rumänien, auch unter dem Begriff „Nearshoring“ bekannt. Pentalog ist mit 550 Entwicklern, welche auf 6 Städte in den Ländern Rumänien und Moldawien verteilt sind, absoluter Spezialist in diesem Gebiet.Dieser Vortrag beschreibt, welche Prozesse Pentalog etabliert hat, um ausgelagerte Projekte unter dem Eindruck \"Software-Entwicklung wie in Deutschland, jedoch zu günstigeren Konditionen“ erscheinen zu lassen.","start":"2014-08-14T14:30:00Z","track":"ALM","speaker":"Hörger, Reiner"},{"title":"Meteor JS - Eine flexible JavaScript PlattformDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"JavaScript-Applicationframeworks gibt es wie Staub auf dem Mond. Jedoch ist jedes nur auf dem Gebiet gut, für das es geschaffen wurde. Meteor versteht sich als eine Plattform, die eine Auswahl der besten Frameworks mit MongoDB und Node.js kombiniert und Entwicklern so das Zusammensuchen abnehmen möchte. Die Hauptmerkmale liegen auf dem reaktiven Programmierparadigma, einer cleveren Latenz-Kompensation, einer einheitlichen Basis des JavaScript-Codes für Client und Server, das automatische Propagieren der Änderungen von Code und Daten, ein vergleichsweise einfaches API-Design und intelligentes Packaging und Deployment von Applikationen. Im Workshop erstellen wir eine Beispiel-Applikation, die alle wichtigen Prinzipien und Vorgehensmethoden von Meteor vom Scaffolding bis hin zum Live-Deployment abdeckt. Die Beispiel-Applikation wird KEINE langweiliger Chatroom sein...!!!","start":"2014-08-14T14:30:00Z","track":"JavaScript","speaker":"Köbler, NikoSpindler, Heiko"},{"title":"Offline-Architekturen für mobile EndgeräteDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mitarbeiter im Außendienst kennen das Problem: Bei einem Kundentermin möchte der Außendienstler alle wichtigen Informationen über den Kunden vor Ort verfügbar haben. Zudem müssen häufig für den Geschäftsprozess wichtige Daten erfasst werden. Da nicht immer die gewünschte Netzabdeckung gegeben ist, werden zur Lösung dieses Problems immer wieder individuelle Synchronisationsmechanismen entwickelt. Es werden verschiedene architektonische Ansätze vorgestellt und deren jeweiligen Vor- und Nachteile verglichen. Dabei gibt es keine One-fits-All Lösung, sondern je nach Anwendungsfall besser geeignete Architekturen. So mag es in einem Einzelprojekt sinnvoll sein, eine stark integrierte proprietäre Lösung des Backend Produktherstellers einzusetzen, während für die unternehmensweite Plattform eine generalisierte Architektur vorzuziehen ist.","start":"2014-08-14T14:30:00Z","track":"Webarchitekturen","speaker":"Pöcher, Christian"},{"title":"Android und iOS vereintDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wie man mit einem Projekt das Beste auf beiden Plattformen umsetztDie Android und iOS Plattform gleichzeitig bedienen, ohne erheblichen Mehraufwand betreiben zu müssen – das ist der Wunsch von vielen App-Entwicklern. Ein Projekt, ein Komponenten-basierter Ansatz und dabei alle Möglichkeiten der jeweiligen nativ Plattformen zu nutzen, geht das überhaupt? Die schlichte Antwort ist Ja. Das ist schon heute möglich mit optimierenden Compilern, aus einer MADP nativ für die Plattformen Android und iOS. Matthias Eißing erstellt in dieser Session vor Ihren Augen eine App, die auf die Kamera zugreift, Bilder machen kann und diese  mit anderen „shared“ …. in einem Projekt für Android und iOS. Er visualisiert den einfachen Datenbankzugriff und die Möglichkeiten zum Austausch von Daten über REST/JSON.","start":"2014-08-14T14:30:00Z","track":"Android","speaker":"Eißing, Matthias"},{"title":"Weißbuch der Architektur DokumentationDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Dokumentieren zählt nicht unbedingt zu den Lieblingsbeschäftigungen eines Entwicklers. Und dann auch noch Architektur? Kästchen, Linien, Wolken? Wirkungsvolle Architekturdokumentation ist keine bunte High-Level Powerpoint-Präsentation. Sie macht zentrale Entscheidungen auch später noch nachvollziehbar. Aber wie fertigen Sie so etwas an? Einfach UML verwenden? Standardisiert, kann jeder lesen ... Diese tolle Vorlage ausfüllen?  Vergisst man garantiert nichts ... Mit solchen beraterwürdigen „Tipps“ verschone ich Sie in dieser Session. Stattdessen gibt es echtes Erfahrungswissen zum Festhalten Ihrer Softwarearchitektur, und zur Kommunikation im Team und an Dritte. Handlich abgepackt zum Mitnehmen und zum Zuhause ausprobieren.","start":"2014-08-14T15:45:00Z","track":"Architektur","speaker":"Zörner, Stefan"},{"title":"Automatisiertes Testing mit iOSDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Der Vortrag gibt einen Überblick über die Möglichkeiten von Automatisierten Testing mit iOS geben. Dabei wird auf die Themen Projektaufbau, Unit-Tests, View Tests, Integration Tests, Automatisierte Verteilung von Beta Versionen und das automatisierte Bauen von Apps mit einem Continuous Integration System eingegangen. Insbesondere soll auf die Stolperfallen und Best Practices aus der praktischen Erfahrung während der Entwicklung eingegangen werden.","start":"2014-08-14T14:30:00Z","track":"iOS","speaker":"Schulze, Felix"},{"title":"Testmanagement mit Visual Studio 2013Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Testplanung und – Definition sind mit dem Microsoft Test Manager und TFS 2013  WebAccess Testhub schnell gemacht. Wie strukturiere ich meine Tests, so dass Pflege- und Wartungsaufwand möglichst gering sind? Wie kombiniere ich meine formalen Tests mit agilen Test? Kann mich der Test Manager bei agilen Tests oder im abgeschotteten Testlabor unterstützen? All diese Fragen werden in dem Vortrag beantwortet und Tipps und Tricks für die Praxis gegeben.","start":"2014-08-14T15:45:00Z","track":"Visual Studio","speaker":"Orschel, Nico"},{"title":"Mobile Games mit Windows AzureDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Im letzten Jahr entstand für einen großen Kunden ein Mobile Game für iOS, das serverseitig auf Windows Azure basiert. Zum Einsatz kommen dabei Compute-Instanzen, Backup, Table Storage, SQL Database. Die Spiel-Logik wurde serverseitig mit CQRS umgesetzt, das für Azure ideal einsetzbar ist. Der Vortrag gibt einen Einblick in die Architektur und zeigt den Einsatz der gewählten Azure-Komponenten.","start":"2014-08-14T15:45:00Z","track":"Azure","speaker":"Gutsch, Jürgen"},{"title":"Underscore.js: The Missing Parts of JavaScriptDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Underscore.js ist die Komponente, die in keiner modernen JavaScript-Anwendung fehlen sollte: Sie ergänzt die Sprache um eine Unmenge an nützlichen Funktionen, die ihr in der nativen Ausführung fehlen. In dieser Session lernen Sie die Library Underscore.js kennen – den \"Utility Belt\" der JavaScript-Welt. Mit ihr finden Elemente der funktionalen Programmierung sowie diverse Hilfsfunktionen Einzug in das JavaScript-Universum. Nutzen Sie die Möglichkeit und schreiben Sie verständlicheren Code mithilfe funktionaler Konstrukte, die hochgradig lesbar sind und Ihre Intentionen besser vermitteln als ihre imperativen Verwandten.","start":"2014-08-14T14:30:00Z","track":"Web-Frameworks","speaker":"Schulz, Marius"},{"title":"Webanwendungen in Minuten hochskalierbar bereitstellenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Bei der Bereitstellung von Webapplikationen steht man vor der Wahl zwischen klassischem (Self-)Hosting und modernen Cloud Plattformen. Doch wie helfen Cloud-Plattformen wie Windows Azure dabei in kürzester Zeit die eigenen Anwendungen bereit zu stellen, die Performance zu verbessern sowie Ausfallsicherheit zu gewährleisten? Strategien und Funktionen hierfür, sowie die nötigen Voraussetzungen in der Architektur der eigenen Anwendung werden in diesem Vortrag besprochen. In diesem Vortrag erhalten Sie außerdem einen Einblick in die verschiedenen Betriebsmodelle für Webapplikationen auf Windows Azure sowie deren Vor- und Nachteile.","start":"2014-08-14T15:45:00Z","track":"Webentwicklung","speaker":"Kirchner, Peter"},{"title":"Zentrales Build & Release ManagementDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mit dem TFS 2013 gibt es eine Menge Neuigkeiten, die den Teams helfen, effizienter zu arbeiten. Neben Verbesserungen in verschiedenen Disziplinen des ALM hat Microsoft im Bereich Build- und Releasemanagement ordentlich nachgelegt. Zum einen gibt es neue Build Templates, die deutlich schlanker sind als bisher. Zum anderen stellt Microsoft mit dem Zukauf von InRelease ein Werkzeug zur Verfügung, um den Auslieferungsprozess von der Entwicklungsumgebung über QA-Systeme bis hin zum Kunden mittels Workflows zu automatisieren. Der Vortrag zeigt die Neuerungen bei den Build Templates und was dies für die Anpassung der Templates bedeutet. Außerdem wird Release Management for Visual Studio anhand eines Praxisbeispiels von der Entwicklung bis hin zur Veröffentlichung im Web vorgestellt.","start":"2014-08-14T15:45:00Z","track":"ALM","speaker":"Rümmler, ThomasSchlag, Christian"},{"title":"Modularer Android Code mit DaggerDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Frameworks wie Spring oder Google Guice sind bereits Alltag in der Java-Entwicklung. Dependency Injection führt in der Regel zu einem besser testbaren und strukturiertem Code. Doch bringen sie wirklich mehr Vorteile als Nachteile für mobile Entwicklung? Inwiefern kann Dagger für umfangreiche Projekte sinnvoll eingesetzt werden und Guice sogar ersetzen?","start":"2014-08-14T15:45:00Z","track":"Android","speaker":"Güngören, Onur"},{"title":"High performance websitesDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Kurze Antwortzeiten sind im Web das Wichtigste - nicht nur für Online-Shops. Aber was tun, wenn die Performance nicht ausreicht? Mehr und leistungsfähige Hardware kaufen? In die Cloud migrieren? Eine weitere Cache-Schicht einführen oder die Schuld auf die überforderte Datenbank schieben? Alles mögliche Optionen, aber bevor Sie Hardware-Hersteller und Provider glücklich machen, sollten Sie vielleicht ein mal einen Blick auf Ihre Software-Architektur werfen! Diese Session stellt Konzepte und Ideen für eine hochperformante Software- und Systemarchitektur vor, mit der problemlos vom Einzelserver bis in die Cloud skaliert werden kann.","start":"2014-08-14T15:45:00Z","track":"Webarchitekturen","speaker":"Priebsch, StefanBlankerts, Arne"},{"title":"Twig - Eine PHP Template EngineDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Twig ist eine PHP  Template-Engine, die alle Eigenschaften mitbringt, die man sich von einer solchen Bibliothek wünscht. Sie ist schnell, mächtig, flexibel und sicher. Während des Workshops werden wir sehen, warum Twig in dem letzten beiden Jahren den \"Markt\" an Templating-Lösungen gehörig aufgemischt hat. Die Session zeigt nach einer Einführung in die Syntax, wie man Twig-Templates am besten strukturiert, wie man sie wartbar hält und warum das Thema Sicherheit auch in Templates eine wichtige Rolle spielt. Der Abschluss bildet ein Ausflug in die Entwicklung eigener Erweiterungen für Twig.","start":"2014-08-14T15:45:00Z","track":"Web-Frameworks","speaker":"Haberkern, Timo"},{"title":"Der einzig wahre Objective-C StilDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Nur wenige Themen bieten so viel Sprengstoff wie den Fragen zum Programmierstil. Diese nicht ganz ernst zu nehmende Session löst das Problem ein für alle mal durch die begründete Herleitung des einzig wahren Objective-C Stils (One True Objective-C Style, kurz 1TOCS). Damit nicht alle fluchtartig den Raum verlassen, werden nebenbei eine Menge interessanter Kleinigkeiten über Objective-C vermittelt.","start":"2014-08-14T15:45:00Z","track":"iOS","speaker":"Freese, Tammo"},{"title":"Von Knockout zu AngularJSDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wer auf Knockout.js gesetzt hat, kann mitunter etwas ernüchtert sein. Gerade für größere SinglePage Anwendungen sind zahlreiche weitere JavaScript-Libraries nach und nach hinzuzufügen. Hier positioniert sich AngularJS von Google mit frischen Ansätzen und einem viel umfangreicheren Toolset. In dieser Session werden Knockout und AngularJS miteinander vergleichen. Die jeweiligen Vorteile und Schwächen werden herausgearbeitet und mit Code-Beispielen belegt. Johannes Hoppe beleuchtet die Frage ob und wie ein Umstieg von Knockout auf Angular JS sinnvoll und machbar ist.","start":"2014-08-14T15:45:00Z","track":"JavaScript","speaker":"Hoppe, Johannes"},{"title":"Live-Act \"The Blackscreen\"Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wir freuen uns sehr, Ihnen auf der Developer Week 2014 etwas ganz besonderes anbieten. So konnten wir The Blackscreen für einen Liveauftritt am 14. Juli 2014 im Rahmen der Abendveranstaltung gewinnen. It's deathpop, baby? The Blackscreen machen das, wovon sie überzeugt sind. Zielstrebig, aber ohne Scheuklappen für Genregrenzen, schreiten die vier Indie-Rocker aus Nürnberg auch im vierten Jahr des Bandbestehens stetig voran. 2013 lief gut für The Blackscreen: Mit zwei selbstgedrehten Videos zu den Songs Lullaby und Paraphilia im Gepäck, tourten The Blackscreen durch Polen, das Baltikum und Russland, standen auf Bühnen in Moskau, St. Petersburg, Riga, Tallinn und Berlin und absolvierten nebenher noch diverse Gigs in Deutschland sowie Open Air Slots u.a. mit DeWolff, Itchy Poopzkid und Mustasch. Nun meldet sich die Band mit der aktuellen LP The Space Between Us (Setalight Records) zurück. Diese wurde im Januar 2014 im Tonstudio45 in Koblenz aufgenommen und von keinem Geringeren als dem Blackmail-Gitarristen und Indie-Papst Kurt Ebelhäuser produziert. Auf der Bühne kochen The Blackscreen seit jeher ein scharfes Süppchen aus Energie, Authentizität, Können und erfrischender Unangepasstheit. Ihren Ruf als hervorragende Live-Band haben sie sich durch mittlerweile über 100 Konzerte in 6 Ländern erspielt.","start":"2014-08-14T19:00:00Z","track":"","speaker":""},{"title":"Standardsoftware – Wege aus dem VerwaltungschaosDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Standard und individualisiert – schließt sich das nicht aus? Keineswegs! Um sich Wettbewerbsvorteile zu verschaffen, werden von Kunden individuelle Lösungen benötigt und gefordert. Gleichzeitig soll eine solche Lösung kostengünstig umgesetzt und fortlaufend weiterentwickelt werden. Wie ist dieser Spagat zwischen einer Individuallösung und einem Standardprodukt zu schaffen? Durch eine Architektur, die eine flexibel konfigurierbare und weitreichend erweiterbare Standardsoftware ermöglicht.","start":"2014-08-15T07:00:00Z","track":".NET-Praxis: Shanghai","speaker":"Boost, Benjamin"},{"title":"ThementischeDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"In den vergangenen Jahren kamen auf Abendveranstaltungen unserer Konferenzen bei den Teilnehmern die Thementische sehr gut an. An diesen treffen sich Gleichgesinnte, um gemeinsam Problemlösungen zu finden oder dem „Experten des Tisches“ gezielte Fragen zu stellen. In zwei Schichten stehen die Experten am Montag, 14. Juli 2014 ab ca. 19.00 Uhr 1 Stunde lang den Teilnehmern mit Rat und Antworten zur Seite.Die Thementische sind besetzt mit Experten von 19.00 - 20.00 Uhr und von 20.30 bis 21.30 Uhr. Gerne können Sie auch darüber hinaus über die angebotenen Themen untereinander diskutieren.Sollte Ihnen ein wichtiges Thema fehlen, wenden Sie sich gerne an uns.Unsere Experten präsentieren folgende Thementische:Auch einige Experten von developer media konnten wir für Thementische gewinnen:Eine Woche vor der Developer Week finden Sie hier einen Lage- und Zeitplan für die Thementische.","start":"2014-08-14T17:00:00Z","track":"","speaker":""},{"title":"MapReduce in der PraxisDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Das Programmiermodel MapReduce, welches vor einigen Jahren von Google veröffentlicht wurde, hat Einzug in zahlreiche Systeme erhalten. Dabei wurde es sowohl als eigenständiges System, wie beispielsweise bei Hadoop, Disco oder Amazon Elastic MapReduce, aber auch als Abfragesprache innerhalb größerer Systeme, wie beispielsweise bei MongoDB, Greenplum DB oder Aster Data, implementiert. Diese Session stellt gängige Problemstellungen aus der Praxis vor und wie diese mit dem MapReduce Framework von Microsoft HDInsight umgesetzt werden können.","start":"2014-08-15T07:00:00Z","track":"Daten","speaker":"Dittmann, Sascha"},{"title":"Kommunikation im Internet der Dinge mit MQTTDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Das Internet der Dinge (IoT) und Maschine-zu-Maschine Kommunikation (M2M) ist momentan in aller Munde. Studien zeigen das es bis 2020 50 Milliarden Geräte sein werden, die über das Internet miteinander kommunizieren und jede Sekunde kommen 80 neue Geräte hinzu. Momentan dominierende Protokolle wie HTTP/REST sind nur bedingt geeignet, um die Anforderungen abzudecken. Herausforderungen sind zum Beispiel das Senden von Nachrichten von einem Gerät zu vielen, Skalierung der Anzahl an Geräte, Push Notifications und Sicherstellung der korrekten Übermittlung. Das Publish/Subscribe-Protokoll MQTT erfüllt diese Anforderungen und wurde für mobile Geräte entwickelt. Es wird beispielsweise von Facebook für den Messenger eingesetzt. Dieser Vortrag gibt eine Einführung in MQTT sowie die Implementierung Eclipse Paho und zeigt anhand von Beispielquellcode und einer Livedemo, welche Probleme man damit lösen kann.","start":"2014-08-15T07:00:00Z","track":"Trends","speaker":"Götz, Christian"},{"title":"Das Event im Mittelpunkt: EDA und CEPDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Event Sourcing ist zum Buzzword avanciert. Warum nicht einen Schritt weiter gehen, und Events direkt zum Herzen der Anwendung machen? Hier kommt die Event Driven Architecture ins Spiel. Viele Geschäftsprobleme lassen sich als Strom von Ereignissen darstellen. Gerade wenn der Strom der Ereignisse umfangreich und stetig ist und Auswertungen in Echtzeit erfolgen sollen, kommen die Stärken dieses Architekturansatzes zum Tragen. Die Session zeigt Szenarien auf in denen EDA erfolgversprechend ist und illustriert diese Anhand eines praktischen Beispiels.","start":"2014-08-15T07:00:00Z","track":"Architekturpraxis","speaker":"Richling, Tobias"},{"title":"Responsive Webdesign: Status QuoDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Zu einer responsiven Webseite gehört weit mehr als ein paar Anpassungen im CSS. Momentan ist von mobile-first die Rede und es ist lange nicht nur eine technische Herausforderung, eine richtig gute responsive Webseite zu erstellen. Sehen Sie in diesem Vortrag den aktuellen Stand, was die Technik zurzeit bietet und woran gearbeitet wird: Von Box-Modellen bis Frameworks, über APIs zu Best Practices. Eines steht jetzt schon fest: Wir sind noch lange nicht am Ende!","start":"2014-08-15T07:00:00Z","track":"Responsive Webdesign","speaker":"Bez, Roberto"},{"title":"Node.js-Anwendungen mit Visual Studio entwickelnDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Node.js hat sich zu einer der beliebtesten Plattformen für das Schreiben von serverseitigem Code entwickelt. Das Node.js-Framework basiert auf der Google V8 JavaScript-Engine und ermöglicht die Entwicklung von JavaScript-Serveranwendungen. Im November 2013 hat Microsoft die \"Node.js Tools für Visual Studio (NTVS)\"  vorgestellt. Damit können Windows-Entwickler Node.js Anwendungen mit Visual Studio entwickeln. Die NTVS werden als Plug-in in Visual Studio integriert und bieten Zugriff auf die Codevervollständigung und die Debugging-, Profiling- und Deployment-Funktionen von Visual Studio. Das Plug-in enthält auch eine grafische Benutzeroberfläche für den Node Package Manager (npm). Damit lassen sich über Visual Studio Bibliotheken aus dem npm-Repository installieren. Auch die Anbindung an die Windows Azure - Plattform ist möglich. In diesem Vortrag werden die Node.js-Plattform sowie die Möglichkeiten der Node.js - Tools (NTJS) vorgestellt. Beispiele zeigen erste Anwendungsmöglichkeiten.","start":"2014-08-15T07:00:00Z","track":"node.js","speaker":"Hecker, Peter"},{"title":"PostgreSQL: Die NoSQL Datenbank die niemand kenntDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"PostgreSQL ist dafür bekannt ein klassisches relationales Datenbanksystem zu sein das mit fixen Datenstrukturen arbeitet. Dass PostgreSQL mittlerweile auch mit schemafreien Daten arbeiten kann ist wenig bekannt. Die Session gibt einen Überblick über die neuen Features von PostgreSQL im Umgang mit schemafreien Daten und erläutert warum es Sinn machen kann ein RDBMs als NoSQL Backend einsetzen zu wollen.","start":"2014-08-15T07:00:00Z","track":"Datenbanken/Datenzugriff","speaker":"Hochdörfer, Stephan"},{"title":"LoB Windows 8 AppsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Line of Business Apps können nützliche Hilfsmittel in der Verbesserung komplexer Unternehmensvorgänge sein. Bei der Erstellung müssen jedoch einige wichtige Dinge berücksichtigt werden, um später eine reibungslose Verwendung für den Endanwender gewährleisten zu können. Zu klärende Fragen sind beispielsweise: Wo und wie werden Daten gespeichert oder wie könnte die Anmeldung am System erfolgen? Der Vortrag beschäftigt sich mit den technischen Hintergründen der Line of Business App-Entwicklung. Es werden die aktuellen Frameworks vorgestellt und ihre Vorzüge und Nachteile erläutert. Des Weiteren soll über die Themen Datenhaltung, Client Server Daten Synchronisierung, Validierung und Fehlerbehandlung in mobilen 3 Tier Anwendungen basierend auf .NET und XAML gesprochen werden.","start":"2014-08-15T07:00:00Z","track":"Next .NET","speaker":"Heinrich, Lars"},{"title":"Top 10 App ErrorsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"AQuA - App Quality Alliance – is a non-profit organization helping developers further-improve the quality of their apps – www.appqualityalliance.org. Through working over the last 10 years with developers, test houses and operators worldwide, AQuA has established that there are 10 app quality errors that come up again and again, irrespective of the platform.   In this presentation you will get to understand what are these errors are, and learn how they can be avoided.","start":"2014-08-15T07:00:00Z","track":"Cross-Plattform","speaker":"Wrigley, Martin"},{"title":"App Marketing: Nobody loves my AppDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die eigene App ist fertig und wurde im Store veröffentlicht. Schnell zeigt man die App den Freunden und Bekannten. Die Feedbacks sind überaus positiv. Die Idee gefällt jedem. Das Design ist zudem auch vielversprechend. Doch nüchtern betrachtet sind die Downloadstatistiken immer noch nicht berauschend. Der große Durchbruch wurde leider nicht erzielt. Nobody loves my App! Nein, es handelt sich nur um falsches Marketing! Dieser Vortrag zeigt durch ein Praxisbeispiel wie die eigene App mit strategischen Vorgehensweisen an Beliebtheit gewinnt. Es wird eine allgemeine Einführung zum Thema App Marketing gezeigt und wie die App an die richtige Zielgruppe gelangt.","start":"2014-08-15T07:00:00Z","track":"Mobile Praxis","speaker":"Biswanger, GregorReuter-Heinrich, Peggy"},{"title":"Code Reviews - Jeder kennts, keiner machtsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Besser informierte Teammitglieder und qualitativ hochwertigere Programme – beides lässt sich mit gut geplanten Code- und Architektur-Reviews erreichen. Das gemeinsame Durchgehen von Quelltexten und Strukturentscheidungen hilft nicht nur, den Wissensaustausch unter allen Beteiligten zu fördern, sondern bringt auch Fehler frühzeitig ans Licht.","start":"2014-08-15T08:30:00Z","track":".NET-Praxis: Shanghai","speaker":"Boost, Benjamin"},{"title":"Erstellung einer prototypischen Windows 8.1 AppDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Lars Heinrich und Peggy Reuter-Heinrich zeigen in dieser Session an einer konkreten Beispiel-App, wie Entwicklung und Oberflächengestaltung einer Anwendung - mit den richtigen Tools und der richtigen Einstellung - Hand in Hand funktionieren kann. Besonderes Augenmerk setzen sie hier auf Entwicklung für Windows 8.1 und den zugehörigen Neuerungen in Entwicklung und Design-Paradigmen. Sie berichten außerdem über mögliche Stolpersteine sowie Best-Practices aus Entwicklung und Arbeitsalltag - alles in ihrer typisch informativen aber auch unterhaltsamen Art. In einer Stunde zeigen die beiden, wie im Zusammenspiel von Blend VS 2013 und Visual Studio 2013 sowie in der optimalen Arbeitsverteilung zwischen Designern und Entwicklern eine App von 0 auf 100 fast bis zur Publikationsreife entstehen kann. Der Vortrag ist keine langweile Powerpoint-Präsentation, sondern geprägt von Showcoding und Blicke in Code und Labor.","start":"2014-08-15T08:30:00Z","track":"Next .NET","speaker":"Heinrich, LarsReuter-Heinrich, Peggy"},{"title":"Professionelle Datenbankentwicklung mit den SSDTDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Bereits seit März 2012 steht mit den SQL Server Data Tools (SSDT) für Datenbankentwickler innerhalb von Visual Studio eine projektbasierte Entwicklungsumgebung zur Verfügung. Doch obwohl SSDT mit Visual Studio 2012 und 2013 automatisch installiert wird, sind diese Art der Datenbankentwicklung und der zur Verfügung stehende Funktionsumfang vielen Entwicklern noch gänzlich unbekannt. Dabei helfen Quellcodeverwaltung, Unit Testing und Continuous Integration nicht nur bei der Anwendungsentwicklung, sondern auch beim Umgang mit Datenbanken. Diese Session wird Ihnen einen guten Überblick über die Vorteile und Möglichkeiten von SSDT geben. Sie werden sehen, wie man SQL-Server- und Azure-Database-Datenbanken aus einer IDE heraus entwickeln, debuggen, refaktorisieren, warten und deployen kann und damit Ihre Datenbankentwicklung auf ein neues Level heben.","start":"2014-08-15T08:30:00Z","track":"Daten","speaker":"Klein, Constantin"},{"title":"Building libraries using CoffeeScript, Node.JSDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"During this talk you'll see how to build libraries for NodeJS or JavaScript using the TDD way. Thorsten Hans, SharePoint MVP, will demonstrate how to use latest and greatest technologies and frameworks for building new components. You'll learn how to use GruntJS for automating common tasks and how to use the combination of ChaiJS and SinonJS in order to write you lib the TDD way.","start":"2014-08-15T08:30:00Z","track":"node.js","speaker":"Hans, Thorsten"},{"title":"Internet der Dinge - mit WebtechnologienDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Moderne Hardwareplattformen wie Raspberry Pi und Beaglebone stellen einen eine hervorragende Basis dar, um mit Webtechnologien wie beispielsweise JavaScript Sensornetzwerke, Hardwareüberwachung, Steuerungs- und Regelungsaufgaben übernehmen zu können und deren Ergebnisse auf Cloud-Server zu übermitteln. Die Session gibt an einem konkreten Beispiel einen Überblick über die Plattformen und wie mit Node.JS auch hardwarenahe Operationen wie Zugriffe auf Bussysteme realisierbar sind. Gezeigt wird, wie per Smartphone-App über einen Cloud-Server Hardware im Haus gesteuert werden kann. Das alles geschieht mit JavaScript.","start":"2014-08-15T08:30:00Z","track":"Trends","speaker":"Haberkern, Timo"},{"title":"ArangoDB – a different approach to NoSQLDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"ArangoDB is an open source NoSQL database which is not narrow-mindedly focused on horizontal scalability. Instead, ArangoDB aims to offer developers great flexibility and ease-of-use. The database is suitable for use cases which are difficult to implement with most traditional relational databases and also many of the other NoSQL databases. Foxx is a JavaScript framework built-into ArangoDB that allows to develop REST APIs rapidly. I will show how ArangoDB and Foxx can help you build Single Page Web Applications faster.","start":"2014-08-15T08:30:00Z","track":"Datenbanken/Datenzugriff","speaker":"Dohmen, Lucas"},{"title":"Responsive Webdesign verkaufenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Responsive Web Design ist in aller Munde, und auch die technischen Möglichkeiten scheinen nahezu komplett, um dies auch technisch hochwertig umzusetzen. Und trotzdem scheitern eklatant viele RWD-Projekte. Dies liegt vor allem am Workflow, der ein Umdenken in allen Positionen erfordert. Das klassische Modell, in dem erst das PSD erstellt wird und dann angefangen wird zu programmieren, scheint nicht mehr zu funktionieren. Und dies ist auch logisch, wenn man sich den RWD-Workflow einmal genauer ansieht. Der Vortrag geht auf alle \"kaufmännischen\" Aspekte von RWD ein, von der Planung über den Prozess bis hin zu Vertragsdetails.","start":"2014-08-15T08:30:00Z","track":"Responsive Webdesign","speaker":"Lobacher, Patrick"},{"title":"Lessons Learned: Building a Mobile CRMDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Eine klassische IT-Umgebung zu mobilisieren birgt viele Herausforderungen. Eigentlich heißt es: Je höher die Anzahl der unterstützen Gerätetypen, desto schwieriger die Aufgabe. Apps, die auf Unternehmensdaten zugreifen, müssen in bestehende Umgebungen integriert werden. In diesem Vortrag beleuchtet Patrick Blitz ein Projekt und die erfolgreiche Integration eines CRM Systems auf iPhone, iPad, Android, Blackberry und Kindle. Dabei geht der Business Development Leiter von Weptun vor allem auf die Vor- und Nachteile des gewählten Integrationsweges ein. Diesen betrachtet er im direkten Vergleich zu anderen von Weptun - als Mobile IT Dienstleister und Softwareanbieter - durchgeführten Projekten in Bezug auf Komplexität, Aufwand und Erfüllung von Sicherheitsrichtlininen.","start":"2014-08-15T08:30:00Z","track":"Mobile Praxis","speaker":"Blitz, Patrick"},{"title":"jQuery Mobile Web-App an SAP ERP anbindenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Business Web-Apps an SAP Systeme anzubinden ist keine Hexerei, wenn ein paar Punkte beachtet werden. Im ersten Teil der Session zeige ich die Idee und Architektur von SAP für Web-Apps auf. Dabei kommt die Bedeutung der SAP Mobile Plattform, SAP Gateway und UI5 zur Sprache. Eine kleine Demo veranschaulicht dies. Im zweiten Teil folgt ein Praxis-Beispiel (Regie-Rapport), das die Anbindung einer jQuery Mobile Web-App an das SAP ERP System ohne grosse zusätzliche Infrastruktur aufzeigt. Anhand dieses konkreten Beispiels erläutere ich die Möglichkeiten und Fallstricken, eine Web-App ohne SAP Technologie an ein SAP-System anzubinden. Die Session soll das Verständnis für eine erfolgreiche Kommunikation zwischen den SAP und Nicht-SAP Projektteams, einer optimalen Architektur und einer reibungslosen Umsetzung liefern.","start":"2014-08-15T08:30:00Z","track":"Cross-Plattform","speaker":"Friberg, Philipp"},{"title":"Extreme Domain ModellingDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Viele unserer \"Objekte\" sind einfach nur Datenstrukturen oder Projektionen von Tabellen aus der Datenbank. Sie beschreiben lediglich einen Zustand. In der Objektorientierung wird dieser Zustand gekapselt und mit Verhalten kombiniert: Verschiedene Prinzipien und Muster helfen uns dabei, aus einfachen Datencontainern ein echtes Objektmodell zu entwickeln. Die Konzepte der funktionalen Programmierung rücken schließlich den Zustand in den Hintergrund und das Modell reduziert sich im Grunde auf pures Verhalten. Dieser Vortrag zeigt anhand eines Beispiels die schrittweise Entwicklung eines einfachen Klassenmodells, beginnend bei datengetriebenen Entities über Objektorientierung hin zu funktionalen Einheiten.","start":"2014-08-15T08:30:00Z","track":"Architekturpraxis","speaker":"Traub, Dennis"},{"title":"Die mystische CRUD-3-Schichten-ApplikationDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"\"Ist nur eine ganz kleine Applikation, eigentlich reines CRUD\". Diesen oder ähnliche Sätze hat wohl jeder Entwickler schon mal gehört und vielleicht sogar einmal geglaubt. Später stellt sich dann heraus, dass ja doch etwas mehr zu tun ist... Die Session zeigt auf, wohin einen der CRUD Ansatz führt. In einem Rundflug über Architekturansätze a la DDD, CQRS und Co. werden Auswege aus dem Schlamassel aufgezeigt.","start":"2014-08-15T09:45:00Z","track":"Architekturpraxis","speaker":"Richling, Tobias"},{"title":"Cross-Platform Entwicklung mit C#Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wie kann ich native Apps für Windows und Windows Phone schreiben und dabei möglichst viel Code wiederverwenden? Was kann ich tun, um meine Bibliotheken für die Wiederverwendung auf verschiedenen Plattformen vorzubereiten? Bei unserem Vortrag bekommst du einen Einblick in unsere Vorgehensweise bei der Entwicklung von Wunderlist als Universal App für den Windows Store und für Windows Phone 8.1.","start":"2014-08-15T09:45:00Z","track":"Next .NET","speaker":"Lang, ChristianOuweland, Loek van den"},{"title":"Prototyping und Entwicklung mit dem SharePoint DesignerDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Der SharePoint Designer eignet sich nicht nur für die Erstellung von SharePoint Prototypen und Showcases sondern auch für die Realisierung komplexer und umfangreicher SharePoint Projekte. Entwickler können SharePoint Komponenten und Web-Technologien wie JavaScript, HTML5 und CSS3 nutzen um schnell Lösungen für Anwendungsbereich zu schaffen, in welchen der Einsatz von Entwicklungsinfrastruktur wie Visual Studio und Team Foundation Server nicht möglich sind. In dieser Session lernen Sie Möglichkeiten und Vorteile des SharePoint Designers kennen und erhalten einen Einblick in die Entwicklungsarbeit und den Entwicklungsprozesse mit dem SharePoint Designer um auch komplexe SharePoint Projekten zu meistern. Zudem werden die Möglichkeiten der Teamarbeit mit dem SharePoint Designer beleuchtet.","start":"2014-08-15T09:45:00Z","track":".NET-Praxis: Shanghai","speaker":"Tews, Alexander"},{"title":"Herausforderungen im DatenzeitalterDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Alle sprechen von Datenexplosion, Big Data und dem „Internet der Dinge“. Doch was bedeutet das eigentlich nun für die Softwareindustrie? Welchen Herausforderungen müssen wir uns stellen und auf welche Anforderungen an Software müssen wir uns gefasst machen? Begeben Sie sich in dieser Session mit Constantin auf die Suche nach Antworten und Erkenntnissen. Erwarten Sie nicht die konkrete technische Lösung, sondern seien Sie vielmehr gespannt darauf auch im Offensichtlichen noch neue Aspekte zu entdecken und schärfen Sie Ihren Blick für die Software der Zukunft.","start":"2014-08-15T09:45:00Z","track":"Daten","speaker":"Klein, Constantin"},{"title":"Leistungssteigernde Maßnahmen: StreamsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mit Node.js ist es kinderleicht, eine Datei zu komprimieren und an den Webbrowser zu übertragen - vorausgesetzt, sie umfasst nicht mehrere GBytes und tausende von Clients. Doch was, wenn? Glücklicherweise gibt es einen Ausweg: Anstatt die gesamte Datei in den Arbeitsspeicher zu laden, kann man sie on-thy-fly verarbeiten! Auf diesem Weg kann man Daten ausliefern, während sie noch gelesen und komprimiert werden, ohne Zeit- und Speicherverlust. Dies verbessert nicht nur den Leistungsbedarf der Anwendung, sondern verringert auch noch die Antwortzeiten. All die Magie dieses Vorgehens steckt in einem einzigen, kleinen und unscheinbaren Modul namens \"streams\". Nahezu jeder Node.js-Entwickler verwendet es täglich, aber kaum jemand weiß, wie es intern funktioniert. Höchste Zeit, das zu ändern.","start":"2014-08-15T09:45:00Z","track":"node.js","speaker":"Roden, Golo"},{"title":"Wearable Android - Developing for Google GlassDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Google Glass is a new kind of wearable Android device. Even though it is running Android 4 and most of the Android frameworks are available for Glass, developing for Glass is different. Not every use-case can be transferred to Glass. Instead apps have to be customized for the Glass experience. This talk shows how experienced Android developers can use the Mirror API and the Glass Development Kit (GDK) to develop rich Glassware applications.","start":"2014-08-15T09:45:00Z","track":"Trends","speaker":"Kaspari, Sebastian"},{"title":"Fiese Fallstricke und sexy StrategienDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Was Responsive Webdesign meint, ist klar: Ein Layout, das sich flexibel an die Bildschirmgröße des Clients anpasst – für einen perfekten Auftritt auf dem Smartphone ebenso wie auf dem UltraHD-TV. Was so schön klingt, birgt aber auch viele Fallstricke. Der Vortrag wird einige dieser vorstellen: Von extravaganten Kundenwünschen, den häufigsten Fehlern im RWD, überraschender Browser-Inkompatibilität und der Verwendung von iFrames bis hin zu responsiven HTML-Newslettern. Abgerundet wird die Session durch Beispiele für den Workflow und das Thema SEO im Zusammenhang mit Responsive Webdesign.","start":"2014-08-15T09:45:00Z","track":"Responsive Webdesign","speaker":"Weber, Johannes"},{"title":"Plattformübergreifende App UsabilityDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Was nützt die schönste App mit den meisten Features, wenn sie nur mäßig bedienbar ist und der User daran verzweifelt? Usability ist einer der wichtigsten Aspekte und der Kern einer gut bedienbaren App. Dieser Vortrag gibt einen grundlegenden Einblick in die Welt der mobilen Usability für Apps und zeigt an verschiedenen Beispielen, wie man die Benutzung einer App für den User zu einem positiven Erlebnis machen kann.","start":"2014-08-15T09:45:00Z","track":"Cross-Plattform","speaker":"Stark, ThorstenGralak, Michal"},{"title":"Mobile TestingDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Der Vortrag soll einen Einblick in die Welt des Mobile Testings geben und beschäftigt sich unter anderem mit folgenden Fragen:","start":"2014-08-15T09:45:00Z","track":"Mobile Praxis","speaker":"Schulze, Felix"},{"title":"SeekYouRS - Happy Path CQRS FrameworkDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wer versucht hat CQRS in seinem Projekt anzuwenden, stieß schnell an die Grenzen der Ordnung. Alles wurde einfach nur unübersichtlich und Verwirrung machte sich breit. Schluss damit, denn nun kommt SeekYouRS - Sinnbild für \"suche nicht lange, implementiere\". SeekYouRS bringt die wichtigsten Elemente einer CQRS Implementierung mit und hilft dabei sich immer am roten Faden entlang zur Lösung hin zu bewegen.","start":"2014-08-15T11:45:00Z","track":"Architekturpraxis","speaker":"Fellien, Jan"},{"title":"CodedUI in der Praxis: Lokalisierung bis NachhaltigkeitDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wie effizient auch immer Ihre Testfälle verwaltet werden, der Aufwand für die Durchführung der Tests entscheidet letztlich darüber, wie häufig Software-Stände veröffentlicht werden können. Im Kontext der agilen Bewegung wird es immer wichtiger, öfter Software-Inkremente abzuschließen und auch getestet zu haben. Vom kontinuierlichen Testen ist da die Rede. Nur mit entsprechender Testautomatisierung ist das zu meistern. Wir zeigen, welche Probleme bei einer UI-basierenden Testautomatisierung in der Praxis lauern und welche Lösungsansätze sich in der Praxis bewährt haben! Themenschwerpunkte sind dabei Wartbarkeit, Lokalisierung und Nachhaltigkeit.","start":"2014-08-15T11:45:00Z","track":".NET-Praxis: Shanghai","speaker":"Orschel, Nico"},{"title":"Die richtige Mobile Enterprise-Strategie: Integration von Backend-SystemenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die Nutzung mobiler Geräte steigt rapide, sowohl bei Kunden als auch unternehmensintern. Geschäftsprozesse müssen mobil durchgängig nutzbar sein, damit Unternehmen heute am Markt erfolgreich bestehen können, aber auch um die Mitarbeitereffizienz weiter zu steigern. „Mobile First“ ist für viele Unternehmen bereits erklärte Strategie. Dies ist für die IT-Verantwortlichen eine große Herausforderung. Es gilt nicht nur, verschiedene mobile Betriebssysteme zu unterstützen. Die Abbildung komplexer Geschäftsprozesse auf mobilen Geräten bedeutet auch, dass immer mehr Backendsysteme mit den mobilen Anwendungen integriert werden müssen. Zudem sind sicherer, zuverlässiger Betrieb sowie das Management der zahlreichen Apps zu meistern. Dabei sind steigenden Kosten zu vermeiden. Weder IT-Strategie und Governance noch die eingesetzten Entwicklungswerkzeuge vieler Unternehmen unterstützen diese neue Komplexität bisher ausreichend.\nEinige Konzerne nutzen bereits eine Mobile Enterprise Application Platform (MEAP) und reduzieren damit Kosten und Komplexität der mobilen Applikationsentwicklung signifikant. Plattformübergreifende Entwicklung von hochwertigen mobilen Anwendungen und deren Anbindung an bestehende Backendsysteme gelingt so effizient. Mit cloudbasierten Angeboten wie „Developer Garden powered IBM Worklight“ wird es nun allen Unternehmen möglich, auch ohne hohe Investitionen ihre mobile IT-Strategie auf modernen MEA-Plattformen zu realisieren und Computing- und Network-Infrastruktur on-demand von vertrauenswürdigen deutschen Anbietern zu beziehen. Der Vortrag zeigt anhand praktischer Beispiele, wie eine Mobile Enterprise Application Platform dabei helfen kann, eine langfristig und umfassend ausgelegte Strategie für die Entwicklung und den Betrieb mobiler Anwendungen zu entwickeln, welche diesen Herausforderungen gewachsen ist.","start":"2014-08-15T09:45:00Z","track":"Datenbanken/Datenzugriff","speaker":""},{"title":"Roslyn - Compiler as a ServiceDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Warum sollte ich mich als Enterprise Entwickler für Compilerbau interessieren? Im Normalfall nicht, aber wenn der Compiler plötzlich keine Black Box mehr ist, sondern \"Zur freien Entnahme\" seine Services zur Verfügung stellt, dann wird es auch für Joe Average interessant sich dessen Features anzusehen und Anwendungsfälle für die eigenen Lösungen anzudenken.","start":"2014-08-15T11:45:00Z","track":"Next .NET","speaker":"Wille, Christoph"},{"title":"Twitter Insights mit StreamInsight und HDInsightDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"In dieser Session geben wir einen Einstieg in die große Welt des Big Data anhand eines anschaulichen Szenarios: Wir zapfen die unerschöpfliche und öffentliche Datenquelle von Twitter an und veranschaulichen die einströmenden Tweets und deren Stimmungsanalyse mit Complex Event Processing Tools (StreamInsight) auf Azure. Mit Hadoop auf Azure (HDInsight) und Power BI Tools analysieren wir die angesammelten Tweets auf deren Sentiment/Stimmung, Standort, Tageszeit, Tweeter etc.","start":"2014-08-15T11:45:00Z","track":"Daten","speaker":"Klose, OliviaBoscolo, Patric"},{"title":"3D-Druck für  EntwicklerDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Ein 3D-Drucker besteht aus ziemlich vielen mechanischen Teilen, verbunden mit einer ordentlichen Portion an Software. Beides zusammen ergibt ein faszinierendes Stück an Technik. Mit Abstand glaubt man den 3D-Druck noch zu verstehen, im Detail wird es schon schwieriger. Extruder, Filament, Hot-End sind nur drei Begriffe die einer Erklärung bedürfen. In der Session zeigt ein erfahrener 3D-Druck-Bauer welche Komponenten beim 3D-Drucker welche Rolle spielen.","start":"2014-08-15T11:45:00Z","track":"Trends","speaker":"Caroli, Christian"},{"title":"Entkopplung und Datenqualität in DatenbankenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Heutzutage entstehen viele Datenmodelle, die auf einzelne Anwendungen ausgerichtet sind, oder gar automatisch durch ORM-Produkte generiert werden. Der Fokus liegt dabei meist auf einer schnellen Entwicklung der Anwendung. Dem Entwurf des Datenmodells und einer Architektur mit geringer Kopplung zwischen Datenbank und Anwendung wird dann zu wenig Zeit beigemessen. Der Vortrag beleuchtet die in vielen Datenbanken vorherrschende Kopplungsproblematik und zeigt auf, wie dies insbesondere in wachsenden Systemen und einem unternehmensweiten Systemverbund zu deutlichem Mehraufwand führt. Anhand von Beispielen werden Lösungsmöglichkeiten vorgestellt, die sich aus einer Adaption erfolgreichen Softwareentwicklungsmethoden ergeben: Mit datenbankeigenen Mitteln kann über klar definierte Schnittstellen, einem Entwurf mit Verträgen und dem Einsatz von Daten(struktur)tests die Kopplung reduziert, das Datenmodell verbessert und die erwartete Datenqualität sichergestellt  werden.","start":"2014-08-15T11:45:00Z","track":"Datenbanken/Datenzugriff","speaker":"Worm, Thomas"},{"title":"Responsive Design mit BootstrapDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Bootstrap ist ein Open-Source-Framework von Twitter, das eine Reihe von Hilfsmitteln für die Gestaltung von Websites und Webanwendungen bereitstellt. Die Gestaltungsvorlagen basieren auf HTML und CSS und beinhalten Formulare, Buttons, Tabellen und viele andere Oberflächenelemente. Dieser Vortrag gibt eine Einführung und weitere wertvolle Tipps aus der Praxis.","start":"2014-08-15T11:45:00Z","track":"Responsive Webdesign","speaker":"Biswanger, Gregor"},{"title":"Firefox OS - a (mobile) Web Developer's dreamDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"2011 angekündigt erreicht Firefox OS 2012 den Markt. 2013 sind Telefone mit dem HTML5-Basierten Betriebssystem erhältlich. Doch was steckt dahinter? Wo fängt HTML5 bei dem mobilen Betriebssystem an und welche APIs sind verfügbar? In diesem Vortrag wird aufgezeigt, wie Firefox OS generell aufgebaut ist und welche APIs dem Entwickler zur Verfügung stehen. Weiterhin wird gezeigt, warum dieses unscheinbar wirkende mobile Eco-System ein Riesenschritt für die mobile App-Entwicklung mit HTML5 ist und warum gerade Web-Entwickler ein Auge auf diese Plattform werfen sollten. Anhand von zahlreichen Beispielen werden die APIs und Konzepte erklärt.","start":"2014-08-15T11:45:00Z","track":"Cross-Plattform","speaker":"Sandtner, Carsten"},{"title":"OAuth2 und OpenID ConnectDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die Session zeigt die Konzepte von Oauth und OpenID für die Entwicklung moderner Anwendungen. Vorgestellt werden Konzepte und gezeigt wie sie funktionieren.","start":"2014-08-15T13:00:00Z","track":".NET-Praxis: Shanghai","speaker":"Meier, André"},{"title":"Eine Architektur für die PraxisDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Architekturen sind wichtig für den langfristigen Projekterfolg – das steht außer Frage. Aber was ist eine praxistaugliche Standardarchitektur die auch ohne dedizierten Softwarearchitekten umgesetzt werden kann? David Tielke zeigt Ihnen in dieser Session die Umsetzung einer skalierbaren Mehrschichtenarchitektur, die beliebig an Ihre Unternehmensanforderungen angepasst werden kann. Neben der theoretischen Betrachtung dieser Architekturform und der komponentenorientierten Softwareentwicklung, wird danach eine exemplarische Umsetzung auf Microsofts .NET Plattform gezeigt, welche allerdings auch auf andere objektorientierte Sprachen übertragbar ist.","start":"2014-08-15T13:00:00Z","track":"Architekturpraxis","speaker":"Tielke, David"},{"title":"Smartere Web-Apps entwickelnDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"In diesem Vortrag soll ein Einblick darin gegeben werden, inwiefern Daten von Benutzern der eigenen Website gesammelt und intelligent mit Hilfe von Algorithmen aus dem Bereich des maschinellen Lernens ausgewertet werden können. Somit soll der Zuhörer in die Lage versetzt werden, schlauere Programme zu entwickeln, um Informationen, die täglich auf der eigenen Website entstehen, zu sammeln und davon zu profitieren. Der Vortrag gliedert sich in drei Teilbereiche, wobei jeder ein Kernproblem in der Entwicklung von Online-Anwendungen aufgreift und eine mögliche Lösung auf Basis intelligenter Algorithmen aus dem Bereich des kollaborativen Filterns darstellt:1. Suchen und Bewerten oder „Wie kann ich aus Nutzer-Klicks lernen?“2. Optimierung oder „Wie finde ich die optimale Lösung zu einem Problem?“3. Komplexe Klassifikation oder „Wie erkenne ich zahlungswillige Kunden auf meiner Website frühzeitig?“","start":"2014-08-15T11:45:00Z","track":"Mobile Praxis","speaker":"Nolting, Dr. Michael"},{"title":"Basics of hardware programming Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Ich werde eine Einführung in die Hardwareprogrammierung mit .NET anhand verschiedener Plattformen wie Netduino, Tinkerforge und Raspberry Pi geben. Nach einem Überblick über die Grundlagen der Elekronik sowie der nötigen Software (.NET Micro Framework, Mono) geht es an die konkreten Beispiele, die live programmiert werden. Ziel ist die Erstellung einer \"Continuous Integration Ampel\", mit der der Status des Buildservers (rot, gelb, grün) auch ohne Monitor sichtbar gemacht werden kann.","start":"2014-08-15T13:00:00Z","track":"Next .NET","speaker":"Kawalerowicz, Marcin"},{"title":"Entkopplung und Datenqualität in DatenbankenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Heutzutage entstehen viele Datenmodelle, die auf einzelne Anwendungen ausgerichtet sind, oder gar automatisch durch ORM-Produkte generiert werden. Der Fokus liegt dabei meist auf einer schnellen Entwicklung der Anwendung. Dem Entwurf des Datenmodells und einer Architektur mit geringer Kopplung zwischen Datenbank und Anwendung wird dann zu wenig Zeit beigemessen. Der Vortrag beleuchtet die in vielen Datenbanken vorherrschende Kopplungsproblematik und zeigt auf, wie dies insbesondere in wachsenden Systemen und einem unternehmensweiten Systemverbund zu deutlichem Mehraufwand führt. Anhand von Beispielen werden Lösungsmöglichkeiten vorgestellt, die sich aus einer Adaption erfolgreichen Softwareentwicklungsmethoden ergeben: Mit datenbankeigenen Mitteln kann über klar definierte Schnittstellen, einem Entwurf mit Verträgen und dem Einsatz von Daten(struktur)tests die Kopplung reduziert, das Datenmodell verbessert und die erwartete Datenqualität sichergestellt  werden.","start":"2014-08-15T13:00:00Z","track":"Daten","speaker":"Worm, Thomas"},{"title":"Node.js für WebapplikationenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Node.js als Plattform mit seinen zahlreichen Paketen eignet sich hervorragend zur Umsetzung von Lösungsansätzen für die verschiedensten Problemstellungen. Aufgrund seiner Herkunft kommt Node.js vor allem im Web zum Einsatz. Hier handelt es sich nicht um die Silver Bullet, mit der sämtliche Probleme gelöst werden können. Sie können allerdings mit Node.js sehr solide Webapplikationen umsetzen. In diesem Vortrag erfahren Sie, wie Sie den Quellcode Ihrer Applikation am besten strukturieren, um Ihre Applikation über längere Zeit wartbar zu halten. Aber auch weiterführende Themen wie Paketverwaltung und Skalierung werden behandelt.","start":"2014-08-15T13:00:00Z","track":"node.js","speaker":"Springer, Sebastian"},{"title":"Event Sourcing in der PraxisDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Was passiert, wenn man eine Datenbank mit einem Versionskontrollsystem kreutz? Also: Statt nur den letzten Snapshot eines Objektmodells zu speichern, alle Operationen die State ändern festhält um sie später wieder abzuspielen? Die Antwort: Event Sourcing. Die Loslösung des Objekt-Modells von relationalen Schemata, welche die Schaffung von Domain-Modellen erheblich vereinfacht, die lückenlose Nachvollziehbarkeit der Änderungen, einfaches Debugging kurioser Exceptions und bessere Skalierbarkeit des Data Stores. All das sind nur einige der Vorteile, die Event Sourcing bieten kann.Event Sourcing bringt jedoch auch Probleme mit sich. Wir klären, mit welchen Schwierigkeiten im Praxiseinsatz zu rechnen ist, und welche gängigen Lösungen es gibt.","start":"2014-08-15T13:00:00Z","track":"Datenbanken/Datenzugriff","speaker":"Reitzammer, BenjaminSeitz, Johannes"},{"title":"Raspberry Pi für EntwicklerDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Über den kleinen Computer Raspberry Pi wurde ja schon viel geschrieben. Doch was haben Entwickler davon? Diese Session ist für Developer im Allgemeinen geeignet. Welche Programmiersprachen, Tools oder Datenbanken laufen auf dem Gerät und wenn ja - wie gut? Wozu können die GPIO Pins am Pi von Entwicklern genutzt werden? Dazu wird noch der Aufbau eines Hadoop-Cluster auf Raspberry Pi Basis mit 4 Knoten live vorgestellt.","start":"2014-08-15T13:00:00Z","track":"Trends","speaker":"Ross, Marcus"},{"title":"Responsive Webdesign testen/debuggenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Bisher war das Testen von Webseiten in unterschiedlichen Browsern recht überschaubar, 3-4 moderne Browser hatte man meist im Griff, hinzu kamen manchmal nur Schwierigkeiten mit dem Internet Explorer. In heutigen Responsive Webdesign Projekten kommen noch ein großer Teil an mobilen Browsern hinzu. Hier hat man ein ähnliches Bild, aktuelle Browser sind meist nicht das Problem, aber Android 2.3 oder Opera Mini können schnell problematisch werden. Welche Möglichkeiten man schon während der Entwicklung nutzen kann um das Design in unterschiedlichen Ansichten zu testen und warum das Testen auf echten Geräten absolut notwendig ist, zeigt Sven Wolfermann in seiner Praxis-Session.","start":"2014-08-15T13:00:00Z","track":"Responsive Webdesign","speaker":"Wolfermann, Sven"},{"title":"Cross-Platform LevelsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Um mit einer App 90 % der mobilen Zielgruppe zu erreichen, muss man aktuell für die zwei wichtigsten Plattformen produzieren. Eine plattformübergreifende App-Entwicklung mit einem Hybrid-Framework spart dabei Kosten und Zeit. Welche Hybrid-Frameworks gibt es – und wie entscheidet man sich für das richtige Framework? Was bieten drei der bekanntesten Cross-Platform Frameworks, und wo stecken deren Hürden? Welche App-Funktionen sind in einer Hybrid-Umsetzung performant gut abzudecken? Und wann ist die Grenze zur getrennten nativen Umsetzung erreicht? Erfahren Sie in diesem Vortrag, wann Sie eine plattformübergreifende Entwicklung nutzen sollten – und wann der native Weg der bessere ist. Sehen Sie Umsetzungs-Beispiele auf drei der bekanntesten Cross-Platform Frameworks.","start":"2014-08-15T13:00:00Z","track":"Mobile Praxis","speaker":"Trappe, Udo"},{"title":"Reactive ExtensionsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Performante Datenein- und Ausgabe, Echtzeitdatenanalyse, verteilte Geschäftprozesse und stetig verfügbare Benutzeroberflächen mit hoher Nutzerinteraktion sind in heutigen Anwendungen nicht mehr wegzudenken. Wer Anforderungen dieser Art umsetzen möchte, kommt um eine effizente Nutzung der Multi-Core CPUs und eine verteilte Anwendungsarchitektur mit asynchroner Datenverarbeitung nicht herum. In diesem Workshop lernen Sie das Programmiermodel und dessen Anwendung der deklarativ funktionalen Beschreibung von Anforderungen mittels der Reactive Extensions genau kennen. Neben dem Umgang von Rx-Operatoren zur Verarbeitung von asynchronen Datenströmen ist das Umdenken von synchroner zu asynchroner Verarbeitung, Zeitfaktoren, asnychrones Testen und die Verarbeitung ereignisgetriebener Prozesse von zentraler Bedeutung.","start":"2014-08-15T14:30:00Z","track":".NET-Praxis: Shanghai","speaker":"Bild, Mike"},{"title":"Gießen beliebiger Datenstrukturen mit EventsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die Softwareentwicklung leidet unter dem Hang zu einer vorzeitigen Optimierung. Perfide ist die, weil sie sich als Tugend tarnt. Die Rede ist von der Entwicklung zentraler Datenschemata. Das können Objektemodelle oder persistente Schemata sein. RDBMS oder NoSql machen keinen Unterschied. Das Problem liegt im Anspruch des \"one size fits all\". Erleichterung verspricht hier Event Sourcing. Denn aus Events lassen sich Datenstrukturen on demand und JIT generieren. Das spart Zeit und erhöht die Evolvierbarkeit.","start":"2014-08-15T14:30:00Z","track":"Architekturpraxis","speaker":"Westphal, Ralf"},{"title":"Mobility-as-a-Service: Secure cross-platform app development leveraging the cloud Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"In today’s world, mobile enabled business processes are becoming more and more a key requirement to run a business successfully. As mobile apps proliferate, the cloud has emerged as a key enabler of this growth. Cloud delivery of mobile apps accelerates time to value and speed to market, making availability of new capabilities instantaneous. Large companies use Mobile Enterprise Application Platforms (MEAP) to reduce cost and complexity of mobile app development significantly. They integrate backend systems into mobile apps to make existing data available and feed new data into ERP and CRM systems so that business processes run seamless. However, due to high upfront investments, small and midsized companies have not been able to leverage the power of such Mobile Enterprise Application Platforms in the past. Cloud technology can eliminate this barrier now. IBM and Deutsche Telekom combined their strengths in the new cloud-based MEAP solution Developer Garden powered IBM Worklight. The session will provide an overview on how companies that traditionally may not have the resources to obtain enterprise-grade mobile tools are now able to benefit from a MEAP to build high quality mobile apps without large upfront investments - securely hosted on Deutsche Telekom servers and with an instant access to Deutsche Telekom’s communication features such as speech-driven Interactive Voice Response (IVR), voice mashups and Short Message Service (SMS).","start":"2014-08-15T13:00:00Z","track":"Cross-Plattform","speaker":"Montañola, Mireia"},{"title":"Libs, ohne die ich nicht mehr programmieren willDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Könnt ihr euch an die Zeit erinnern, als ihr euren eigenen Logger entwickeln musstet? Habt ihr düstere Erinnerungen daran \"per Hand\" XML-Dokumente zu deserialisieren? Zum Glück haben sich die Zeiten geändert. Wir stehen auf den Schultern von Riesen und verwenden täglich schlauere Tools und Bibliotheken. Wenn man an Programmieren ohne unsere Lieblings-Bibliotheken denkt, klingt das so, als wollte man einen Marathon ohne Schuhe laufen: man könnte es wahrscheinlich schaffen, würde es aber ungern machen wollen. In diesem Vortrag werden fünf kleine OpenSource-Bibliotheken vorgestellt die mir immer wieder das Leben einfacher machen:\n- NodaTime: um nie wieder mit Zeitzonen ringen zu müssen\n- JsonFx & Json.NET: so dass ihr auch denkt dass JSON und C# füreinander gemacht wurden\n- TinyIoc: weil Inversion of Control eigentlich ein Kinderspiel ist- RESTSharp: als Paracetamol für eure HttpWebRequest-Kopfschmerzen","start":"2014-08-15T14:30:00Z","track":"Next .NET","speaker":"Bourguignon, Timothée"},{"title":"Smartwatch HackingDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Pebble, I'm watch und AGENT eröffnen Entwicklern einzigartige Möglichkeiten, im Bereich der sog. Smartwatches Lösungen zu implementieren. In seinem Talk stellt Robert die verschiedenen technischen Ansätze vor und zeigt, wie Oberflächen und Apps für die verschiedenen Systeme entwickelt werden können und wie man eine Smartphone App mit einer Smartwatch App verbindet.","start":"2014-08-15T14:30:00Z","track":"Trends","speaker":"Virkus, Robert"},{"title":"Node.js versus .NET - Teil 1Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Das große Finale zur dotnetpro Artikelserie Node.JS vs. .NET. Live werden Golo Roden und Jürgen Gutsch gegeneinander antreten um mit Ihrer favorisierte Technologie Aufgaben zu lösen. Tilman Börner (der Chefredakteur der dotnetpro) wird als Moderator und Schiedsrichter zwischen den Kampfhähnen stehen.","start":"2014-08-15T14:30:00Z","track":"node.js","speaker":"Gutsch, JürgenRoden, Golo"},{"title":"Anwendungsfälle für ElasticsearchDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Elasticsearch findet als verteilte Volltextsuchmaschine immer weiter Verbreitung. Die Basis Lucene bietet viele für die Suche notwendige Features, die durch eine einfach zu bedienende REST-API von Elasticsearch zur Verfügung gestellt werden. In diesem Vortrag werden anhand unterschiedlicher Anwendungsfälle einige wichtige Eigenschaften von Elasticsearch vorgestellt: Die verteilte Natur ermöglicht die Speicherung auch großer Datenmengen auf denen dann einfach gesucht werden kann, Geo-Spatial-Features ermöglichen die Handhabung von Geo-Koordinaten und die Suche darauf, flexible Auswertungen über die Oberfläche Kibana werden häufig zur Logfile-Analyse eingesetzt, sind aber auch für andere Zwecke nützlich.","start":"2014-08-15T14:30:00Z","track":"Daten","speaker":"Hopf, Florian"},{"title":"Enterprise-DB-Technologie in der CloudDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"IBM ist der Dinosaurier unter den IT-Unternehmen und hat mehrere Jahrzehnte Erfahrung mit Datenbanksystemen für unternehmenskritische Anwendungen. Wie sieht es aber mit Datenbanken für mobile Anwendungen, mit Unterstützung für NoSQL und Cloud-basierten Diensten aus? Wie kann man einfach Anwendungen für UND in diesen Umgebungen entwickeln? Wir werden zeigen, wie der Dinosaurier fliegen gelernt hat und wie Entwickler und Unternehmen davon Gebrauch machen können. Nach einer Einführung werden wir IBM Bluemix, die Cloudfoundry-basierte \"Platform as a Service\" (PaaS) vorstellen und die Entwicklung einer modernen Datenbankanwendung für die Cloud demonstrieren.","start":"2014-08-15T14:30:00Z","track":"Datenbanken/Datenzugriff","speaker":"Kienzler, RomeoLoeser, Dr. Henrik"},{"title":"Native multiplattform Apps mit Enterprise ScopeDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Unternehmen benötigen häufig eine Vielzahl an Apps. Unternehmensinterne Apps (B2E) haben andere Anforderungsprofile als Consumer-Apps (B2C). Es bietet sich sowohl aus technischen, organisatorischen wie auch wirtschaftlichen Gründen an, eine Plattform zu etablieren, die sowohl B2E als auch B2C Szenarien abdeckt. Wir beleuchten, welche Kriterien bei der Entscheidung für die geeignete Plattform herangezogen werden sollten. Für die Umsetzung der Potenziale sind noch weitere Schritte notwendig. Wir legen dar, wie qualitativ hochwertige Apps effizient konzeptioniert, entwickelt und betrieben werden können.","start":"2014-08-15T14:30:00Z","track":"Cross-Plattform","speaker":"Wieschollek, MartinKlewes, Christopher"},{"title":"Apache Cordova und Frameworks für hybride AppsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Apps für Android und iOS müssen nicht in JAVA oder Objective-C entwickelt werden. Mit zunehmender Performance auf den mobilen Geräten gewinnen hybriden Apps wieder an Boden. Mithilfe von HTML5, JavaScript und z.B. Apache Cordova (vormals PhoneGap genannt) lassen sich bestehend Teams, bekannte Tools und Web-Know-how weiter verwenden. Doch mit der Entscheidung für eine hybride Anwendung steht die Wahl einer geeigneter JavaScript Bibliothek an. Sollte die Anwendung MVVM unterstützen oder sind klassische Ansätze empfehlenswert? Wie kann eine hybride Anwendung ein natives Aussehen erhalten? Johannes Hoppe beantwortet Ihre Fragen und stellt Ihnen drei mobile Frameworks vor. Erfahren Sie, wo die Stärken und Unterschiede bei Bootstrap & Knockout, jQuery Mobile sowie Kendo UI Mobile liegen. Hierfür entwickelt Johannes Hoppe live in Visual Studio und mit Apache Cordova eine App zur Anzeige der DWX-Sessions.","start":"2014-08-15T14:30:00Z","track":"Mobile Praxis","speaker":"Hoppe, Johannes"},{"title":"Testing responsive WebdesignDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Responsive Webdesign stellt Frontend-Entwickler vor eine große Herausforderung: Die enorme Vielfalt an Endgeräten und Screens rief eine ebenso große Anzahl an Frameworks hervor, um den differenzierten Anforderungen Herr zu werden. Wie aber testet man die erfolgreiche Implementierung ohne einen Fuhrpark an Geräten? Eine Möglichkeit: automatisierte Lösungen. Diese decken zumindest einen Teil der Fälle ab, vernachlässigen jedoch die Erkennung von Darstellungsproblemen, da diese automatisiert praktisch unmöglich ist. Menschen sind nicht zuletzt aufgrund ihres ästhetischen Empfindens somit beim Testen unerlässlich. Die Antwort heißt Crowd Testing: Eine weltweite Crowd aus Softwaretestern steht mit ihren echten Geräten bereit, alle Arten von Mobile Apps und Webanwendungen zu testen. In diesem Talk zeigt Jan Schwenzien, wie man Crowd Testing effektiv einsetzt und dabei Zeit, Geld und Nerven spart.","start":"2014-08-15T14:30:00Z","track":"Responsive Webdesign","speaker":"Schwenzien, Jan"},{"title":"Softwareentwurf liveDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Bei aller Agilität scheint es doch nicht so ganz ohne Entwurf zu gehen. Aber wie? Was ist das rechte Maß? Wieviel Nachdenken sollte vor dem Codieren stattfinden? Und wie dieses Nachdenken dokumentieren? In dieser Session macht es Ralf Westphal vor. Live. An einer Aufgabe aus dem Publikum. Denn nur dann glauben Sie ja wirklich, dass Softwareentwurf so leicht sein kann, dass er auch für Ihre Praxis tauglich ist. Bringen Sie also eine Aufgabe mit und fordern Sie Ralf Westphal heraus.","start":"2014-08-15T15:45:00Z","track":"Architekturpraxis","speaker":"Westphal, Ralf"},{"title":"Usability praktischDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Am Anfang wird ein kurzer Überblick gegeben, was Usability ist, wie Usability Experten arbeiten und wie die Bedienbarkeit von Produkten erhöht werden kann. In einem zweiten Teil machen wir einen Review über bestehende Programme und zeigen Tipps und Tricks, wie man mit einen Mitteln die Bediener glücklicher machen kann.","start":"2014-08-15T15:45:00Z","track":".NET-Praxis: Shanghai","speaker":"Pichler, Bernhard"},{"title":"Entity Framework 6.x - Erweiterungs MöglichkeitenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Das Microsoft Entity Framework 6.x wartet mit einer Vielzahl von (neuen) Eigenschaften auf und bietet im Vergleich zu den Vorgängerversionen weitreichende Möglichkeiten Anpassungen und Erweiterungen am Basisframework vorzunehmen. Die neuen Features und die Fähigkeit Anpassungen vorzunehmen bilden die Grundlage nützliche Frameworks und Hilfsmittel um das Entity Framework „herum“ zulegen. In dieser Session werden bestehende Frameworks rund um das Entity Framework 6.x vorgestellt. Des Weiteren wird exemplarisch gezeigt wie (Basis-)Dienste des Frameworks durch eigene Implementierungen ausgetauscht beziehungsweise erweitert werden können.","start":"2014-08-15T15:45:00Z","track":"Daten","speaker":"Haug, Thomas"},{"title":"Node.js versus .NET - Teil 2Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Das große Finale zur dotnetpro Artikelserie Node.JS vs. .NET. Live werden Golo Roden und Jürgen Gutsch gegeneinander antreten um mit Ihrer favorisierte Technologie Aufgaben zu lösen. Tilman Börner (der Chefredakteur der dotnetpro) wird als Moderator und Schiedrichter zwicshen den Kamfpähnen stehen.","start":"2014-08-15T15:45:00Z","track":"node.js","speaker":"Gutsch, JürgenRoden, Golo"},{"title":"Tasks - wie funktionieren die?Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wie funktionieren die Tasks aus der TPL (Task Parallel Library)? Wie werden Tasks gestartet und beendet? Wie kann man Fehler behandeln? Wieviele Tasks kann man starten? Was muss man beachten? Fragen über Fragen, die in dieser Session beantwortet werden.","start":"2014-08-15T15:45:00Z","track":"Next .NET","speaker":"Marquardt, Bernd"},{"title":"Spaß und Freude mit KinectDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Microsoft's Kinect-Sensor liegt mittlerweile in der zweiten Version vor. Sowohl die erste als auch die zweite \"Edition\" bieten dem geneigten Entwickler eine Vielzahl von Möglichkeiten zur Erweiterung der Interaktion zwischen Nutzer und Computersystem an. Dieser Vortrag beginnt mit einem Überblick über die im Sensor enthaltene Hardware. Danach werden die wichtigen Softwarefunktionen Schritt für Schritt vorgestellt: das Themenspektrum beginnt bei der Nutzung von Tiefen- und Farbstrom und endet bei skelettalem Tracking und Gesichtserkennung. Jeder Themenkreis wird durch ein kleines Beispiel demonstriert, die Codebeispiele stehen nach dem Vortrag zum Download bereit. Als kleinen Bonus erfolgt eine Verlosung von einigen von mir geschriebenen Fachbüchern zum Thema.","start":"2014-08-15T15:45:00Z","track":"Trends","speaker":"Hanna, Tam"},{"title":"The Moving Web-Frontend Challenges 2014Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mobile Geräte geben den Takt vor und der Desktop-PC wird zum Legacy-Gerät. Smartphones und Tablets beschleunigen heute die Entwicklung der Webtechnologie und machen Responsive Design zur Pflicht. Daher sind die Anforderungen einer heterogenen Geräte- und Browserlandschaft im Jahr 2014 die größten Herausforderungen bei der Frontend-Entwicklung. Die ständige Anpassung an immer neue Updates und Innovationen bedarf der Automatisierung und einer schlüssigen Toolchain. Jeder technische Ansatz hat Auswirkungen auf das Projekt, die Folgekosten, die Infrastruktur und kommende Requirements. Nur wer den Return on Investment für sein Webprojekt im Blick hat, trifft die richtigen Entscheidungen bei der Auswahl von Methodik und Tools.\n Der Vortrag beschreibt, wie sich die Auswahl der richtigen Technologien abhängig von der Art des Projektes realisieren lässt. Verschiedene Ansätze aus der Praxis werden vorgestellt und die Vor- und Nachteile beschrieben. M-Dot, Multi Channel oder One Web – wann eignet sich welche Methode, was ist konkret zu beachten und wie kann diese in das eigene Projekt integriert werden? Vom Dackelzüchterverein bis zum Großkonzern – präsentiert wird das richtige Modell für unterschiedlichste Projekte.","start":"2014-08-15T15:45:00Z","track":"Responsive Webdesign","speaker":"Guelle, Roland"},{"title":"Cross-Plattform-Entwicklung mit Xamarin und .NETDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wir sind mobil und digital. Überall erreichbar und ständig wo anders. Ein guter Grund über den Tellerrand von Web und Desktop, den klassischen Einsatzorten von .NET, zu schauen. Denn dort gibt es Android und iOS Apps, Linux und Mac OS X. In einem kurzen Rundflug, über diese früher unerreichten Einsatzgebiete, soll näher betrachtet werden, wie mit vorhandenem Wissen auch für diese Plattformen entwickelt werden kann.","start":"2014-08-15T15:45:00Z","track":"Cross-Plattform","speaker":"Seidel, Sebastian"},{"title":"Raspberry Pi JAMDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Den Abschluss der Maker Spaces am 15. Juli bildet ein Raspberry Pi JAM. Dieser findet von 19:30-21:00 im Raum Seoul auf Ebene 3 statt. Folgende Themen stehen bereits fest:\n \nRaspberry Pi als PC-Ersatz, geht das überhaupt?\nDer Raspberry Pi ist ein vollwertiger Linux-PC und das Projekt Kano zeigt welche Ausbaustufen denkbar sind. Lohnt es sich über den Raspberry Pi als Desktopersatz nachzudenken und wie lässt sich damit performant arbeiten? Schauen Sie live zu. Das Image des Test-Rechners können Sie sich kopieren lassen.\n \nRoboter mit Raspberry Pi bauenRoboter sind inzwischen Bestandteil unserer Gesellschaft. Der Raspberry Pi eignet sich hervorragend als Gehirn. Ein eigens entwickelter Roboter wird präsentiert und erläutert. Welche Technik hinter dem Roboter steckt und wie man an solch ein Projekt herangeht, zeigen die Macher des Projektes","start":"2014-08-15T17:00:00Z","track":"","speaker":""},{"title":"Copyright für DeveloperDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"In diesem rechtlichen Vortrag sollen vornehmlich die Urheberrecht des Softwareentwicklers und des Webdesigners beleuchtet , insbesondere typische Praxisprobleme und deren Lösungen vorgestellt werden. Der Vortrag hat sowohl rechtliche Grundlagen, als auch einschlägige Rechtsprechung sowie Praxistipps zum Gegenstand.","start":"2014-08-15T15:45:00Z","track":"Mobile Praxis","speaker":"Bdeiwi, Dr. Sami"},{"title":"Pecha Kucha // Power-Point Karaoke // OpenSpaceDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Im Rahmen der DWX Community Night bieten wir Ihnen auch ein Pecha Kucha an: Damit bekommen Sie \"kurz & knackig\" wichtige Entwicklerthemen an einem Abend und mehr.Am 15. Juli 2014 ab 19.00 Uhr erwartet Sie ein abwechslungsreiches und unterhaltsames Programm, denn hier werden Themen auf das Wichtigste reduziert.Die Regeln:Das Wort Pecha Kucha kommt aus dem Japanischen und ist ein lautmalerischer Begriff, der das Geräusch beschreibt, das entsteht, wenn viele Menschen reden. Im Schnelldurchgang können Teilnehmer ihre Ideen, ihre Arbeit und so weiter zeigen. Kein Vortrag dauert länger als 6:40 Minuten. Danach besteht die Möglichkeit zur Diskussion. - Quelle: pechakucha.deAuch Sie sind eingeladen zum Pecha Kucha, als Zuhörer oder als Vortragender.Karaoke ist oftmals ein willkommenes Abend- und Wochenend-Programm und ist schon lange nicht nur in Japan, seinem Ursprungs-Land, bekannt und beliebt. Zur Instrumental-Version von bekannten Songs singen die Mitspieler mehr oder weniger schräg - hauptsache unterhaltsam.\nBeim Powerpoint-Karaoke werden keine vorgegebenen Liedtexte gesungen, sondern zu vorgegebenen Folien-Sätzen einer Powerpoint-Präsentation, ein beliebiger Inhalt vorgetragen - gerne auch gesungen.Die Auswahl der Powerpoint-Präsentationen erfolgt im Vorfeld der Abendveranstaltung durch den Veranstalter, Vorlage dafür ist das Konferenz-Programm der Developer Week 2013. Somit dürften die Folien einigen Teilnehmern schon bekannt sein - zumindest die Themen werden ein Begriff sein.Und so oder so ähnlich können Sie sich das vorstellen: Sehen Sie hier einen Zusammenschnitt eines Ppt-Karaoke Abends auf YouTube.Open SpaceIm Rahmen der DWX Community Night bieten wir Ihnen auch einen Open Space an: Hier sind ausdrücklich auch Teilnehmer aufgefordert, Ihre Projekte vorzustellen oder eine Diskussion anzustoßen. Darüber hinaus finden Themen einen Platz, die nicht mehr ins Konferenzprogramm der DWX 2014 gepasst haben.Am 15. Juli 2014 ab etwa 19.30 Uhr (nach dem Pecha Kucha) bekommen Sie Gelegenheit mitzuwirken:einfach eine Mail an Kerstin Hartmann, wenn auch Sie dabei sein möchten - auch vor Ort gibt es am 14. und 15. Juli noch die Möglichkeit, sich einzutragen, die Liste finden Sie im Registrierungsbereich\n(Stand 30.04.2014)","start":"2014-08-15T17:00:00Z","track":"","speaker":""},{"title":"Codeanalyse Marke EigenbauDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"In Software-Projekten gibt es hin und wieder die Notwendigkeit bestehenden Code programmatisch zu analysieren. Hierfür kann es unterschiedliche Gründe geben. Ein Grund kann das Einweben von querschnittlichen Diensten sein (Aspekt-orientierte Entwicklung (AOP)). Ein weiterer Grund kann die Entwicklung von statischen Codeanalyse-Regeln zur Gewinnung von Metriken sein, z.B. im Rahmen einer Erweiterung eines bestehenden Analysewerkzeugs. Oder aber man möchte (Refaktorierungs-) Plugins für die IDE implementieren. In dieser Session werden die drei Frameworks Microsoft Common Compiler Infrastructure (CCI), Microsoft Roslyn und Mono.Cecil vorgestellt. Hier wird ein Überblick über die Architektur dieser Frameworks gegeben und die Eigenschaften der Frameworks gegenübergestellt. Anschließend wird anhand von Beispielen exemplarisch gezeigt, wie diese in der eigenen Entwicklung genutzt werden können.","start":"2014-08-16T07:00:00Z","track":".NET-Tools","speaker":"Haug, Thomas"},{"title":"Clean Code - Code als kleinster gemeinsamer NennerDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"In dem Beitrag möchte ich vorstellen, was hinter Clean Code steckt, wo es eingesetzt werden sollte und welchen Nutzen es hat. Es ist nicht nur die Definition eines Coding-Guides innerhalb des Teams oder wie man Funktionen und Methoden aufbaut. Es ist mehr eine Einstellung, die man nicht nur für sich selber finden sollte, sondern auch für alle seine Kollegen und vice versa. Clean Code ist ein Bündel von Handhabungsvorschlägen, das in der Summe eine Schnittstelle darstellt, die ein gemeinsames Fundament für alle Developer sein soll. Finden sie in diesem Vortrag heraus, was es mit den verschiedenen Farben und Phasen auf sich hat und wie lange man braucht um Clean Code zu \"verstehen\".","start":"2014-08-16T07:00:00Z","track":"Craftsmanship","speaker":"Foukis, Ilias"},{"title":"Coding DojoDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Im Rahmen der DWX Community Night bieten wir Ihnen auch ein Coding Dojo an: Nach kurzer Einführung einfach loscoden, oder Night Coding? Hendrik Lösch wird Sie am 15. Juli 2014 ab 20.00 Uhr an die Transformation Priority Premise nach Robert C. Martin heranführen.\"Transformation Priority Premise (TPP) is a programming approach developed by Robert Cecil Martin as a refinement to make the process of test-driven development (TDD) easier and more effective for a computer programmer. Transformation Priority Premise states that simpler transformations should be preferred.\" - Quelle: WikipediaAm Workshop-Tag der DWX (17.07.2014 09:00 - 17:00 Uhr) leitet Hendrik Lösch den Workshop Test Driven Development in der Praxis. Für Teilnehmer des Workshops - aber auch alle anderen, die an TDD interessiert sind - ist dieses Coding Dojo zu empfehlen.","start":"2014-08-15T18:00:00Z","track":"","speaker":""},{"title":"C# Dynamics in freier WildbahnDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Seit der Einführung des \"dynamic\" Schlüsselworts in der 4.0-Version von C# streitet sich die .NET-Community zwischen \"böse und gefährlich\" und \"praktisch und cool\". Nach einer Zusammenfassung des Dynamic Konstrukts und dessen Spiel mit der .NET TypSystem werden anhand praktischer Beispiele die Kern-Komponenten der System.Dynamic Namespace, dem DynamicObject und ExpandoObject gezeigt. Neben einer anderen Version des ExpandoObject werden Verwendungsbeispiele von Dynamics, wie XML & JSON Parsing, dargestellt. Der architekturelle Sinn dieser dynamischen Konstrukte wird anhand der Frameworks Nancy & Simple.Data gezeigt. Zuletzt wird anhand eines kleinen Beispiels die Struktur eines Frameworks wie Simple.Data ans Licht gebracht. Dieses Vortrag wird böse dynamische Konstrukte unter die Lupe nehmen, die in unserer stark typisierten .NET-Welt nicht nur Sinn haben sondern von echtem Vorteil sind.","start":"2014-08-16T07:00:00Z","track":"Sprachen","speaker":"Bourguignon, Timothée"},{"title":"Web Services with Symfony2Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Webservices werden mittlerweile in sehr vielen Bereichen der IT zur Integration unterschiedlicher Anwendungen verwendet. Die Klasse der REST-Webservices spielt dabei eine besondere Rolle, da REST sich auf die Grundlagen von HTTP stützt, einfach verständlich ist und leicht in bestehende Anwendungen zu integrieren ist. In diesem Workshop bringen wir den Teilnehmern sowohl die theoretischen Grundlagen von REST, als auch die praktische Umsetzung mit Symfony2 näher. Mit praxisnahen Beispielen werden Themen wie Serialisierung, Content-Negotiation und die Sicherheit von REST-Webservices erklärt und durch realistische Übungsaufgaben verdeutlicht.","start":"2014-08-14T13:00:00Z","track":"Web-Frameworks","speaker":"Seiffert, Paul"},{"title":"Produktentwicklung für die intelligente GebäudetechnikDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Noser Engineering als Entwicklungsdienstleister unterstützte massgeblich einen Kunden aus dem Bereich Gebäudetechnik bei der Produktentwicklung mit agilen Methoden. Gemeinsam mit dem Kunden und anhand eines Demonstrators wird die Geschichte der Entwicklung zusammen mit den Herausforderungen im Technischen- und Projektmanagement-Umfeld erzählt. Wann und warum wurden Entscheidungen im Projekt getroffen? Dabei wird auf die technische Ebene eingegangen.Highlights:Der Teilnehmer lernt die erfolgreiche Entwicklung eines innovativen komplexen Produktes kennen.","start":"2014-08-16T07:00:00Z","track":"Vorgehensmodelle","speaker":"Boehm, Urs"},{"title":"Das streichzarte WebDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Performance-Optimierungen sind wie Schatten an der Wand: Weil der Browser eine Blackbox ist, fischen wir Web Entwickler nach allem, was unsere Seiten ein bisschen schneller macht – auch wenn wir das eigentliche Problem nicht kennen. Aber nirgendwo ist Wissen mehr Macht als hier. Paul Bakaus zeigt Ihnen in diesem Talk was Ihre Site oder Web App wirklich ausbremst, welche Debugging Tools zur Verfügung stehen und wo man besser nicht vorschnell optimiert.","start":"2014-08-16T07:00:00Z","track":"Websprachen","speaker":"Bakaus, Paul"},{"title":"Maintain your Environment with PuppetDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"As a growing provider of web applications, you have to face a growing amount of servers. Setting up a new frontend server is taking days? Setting up a new developers environment requires a senior developer to assist? Well, you might lack automation here! This session introduces you to puppet, a configuration management tool that allows you to set those systems up with no effort. It will give you a brief introduction and a glance at more advanced features.","start":"2014-08-16T07:00:00Z","track":"Schnittstellen","speaker":"Otto, Hans-Christian"},{"title":"Windows Phone und Windows App EntwicklungDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mit dem Release von Windows Phone 8 und Windows 8 setzen die beiden Betriebssysteme zum ersten Mal auf den gleichen Kernel auf. Für Entwickler stellt sich hier natürlich die Frage: Wie einfach ist es mit einmaligem Programmieraufwand beide Plattformen zu bedienen? Dieses Session stellt Euch Strategien vor, die Ihr nutzen könnt um Eure Arbeit nicht zweimal machen zu müssen und arbeitet die Stellen heraus, an denen es sinnvoll ist, dennoch zweimal den Code anzufassen.","start":"2014-08-16T07:00:00Z","track":"Windows Phone","speaker":"Meixner, Daniel"},{"title":"Überleben im Projektdschungel als SoftwareentwicklerDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Softwareentwickler sind in Projekten vielfach einer schwierigen Position. Ihre Fachexpertise ist gefragt, wenn komplexe Probleme eine Lösung erfordern. Doch die geniale Softwarelösung ist nur ein Teil des Projekterfolgs. Schließlich muss die Lösung den anderen Projektmitarbeitern noch kommuniziert und vielfach verkauft werden. Hier geht es weniger um Fachkompetenz (z.B. effektive Projektsteuerung), sondern vielmehr um das Thema Psychologie und damit auf die zwischenmenschliche Ebene im Rahmen der Projektarbeit. Besonders die Rolle des Softwareentwicklers erfordert großes psychologisches Geschick im zwischenmenschlichen Bereich, denn es kann leicht passieren, dass der Entwickler durchgängig in eine Sonder- und Außenseiterrolle gedrängt wird. Dies verkompliziert die Projektarbeit du Abstimmung ungemein.Mein Vortrag fokussiert daher die psychologischen Perspektive auf Projektarbeit im Entwicklungsumfeld. Dabei geht es unter anderem um Themen wie „Ideen verkaufen“; „Konflikte managen“ oder „überzeugen statt überreden“.","start":"2014-08-16T07:00:00Z","track":"Soft Skills","speaker":"Heiss, Dr. Christian"},{"title":"WPF UI Development UnchainedDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Eine herausragende User Experience interaktiver Produkte setzt einen Benutzer-zentrierten Designprozess voraus. Dies allein ist jedoch nicht hinreichend. Erst eine gekonnte Software-technische Umsetzung sorgt dafür, dass ein gutes Design auch beim Anwender \"ankommt\". Tauchen Sie deshalb in die Welt des WPF UI Developments ein und erfahren Sie mehr darüber, wie ein ausgestaltetes UX Design ohne Kompromisse realisiert werden kann. Lernen Sie neben grundlegenden Techniken auch fortgeschrittene Themen wie beispielsweise Attached Properties sowie Behaviors kennen und lassen Sie sich von der Vielfalt des WPF Custom Control Developments begeistern. Neben der technischen Umsetzung spielen auch die Etablierung des UI Developments sowie dazugehörige Workflows, Rollen und Verantwortlichkeiten eine zentrale Rolle.","start":"2014-08-16T07:00:00Z","track":"Desktop","speaker":"Lanninger, AndréThömmes, David C."},{"title":"Mit Touch Develop in die ZukunftDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mit Touch Develop hat Microsoft vor drei Jahren die erste wirklich funktionierende Entwicklungsumgebung für Smartphones auf Smartphones vorgestellt. Zunächst exklusiv für Windows Phone gedacht, wurde Touch Develop schnell um eine webbasierte Oberfläche ergänzt und ist mittlerweile für alle relevanten Zielmärkte verfügbar. Touch Develop unterstützt auf den verschiedenen Systemen entsprechend verfügbare Sensoren wie z. B. NFC, Kamera, Gyroskop, Accelerator und öffnet dem Publikum als eine Plattform zur Entwicklung von Business-Apps, Tools und sogar Spielen. Für jedermann. Dabei begeistert diese Session das Publikum nicht zuletzt durch ein Revival der Turtle, sondern stellt die Bühne auch noch mit ferngesteuerter externer Hardware auf den Kopf. Leuchtende Kugeln, gesteuert mit Touch Develop? LEGO MINDSTORMS Roboter ... direkt auf dem Phone programmiert? Hier sitzt man am besten in der ersten Reihe! Und der Clou: Die Session lädt von Anfang bis Ende zum Mitmachen ein!","start":"2014-08-16T07:00:00Z","track":"Mobile-Tools","speaker":"Jacob, Christian"},{"title":"Päckchen packen mit NuGetDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"NuGet ist in aller Munde, liefert doch Microsoft selbst über diesen Mechanismus zahlreiche sinnvolle Erweiterungen zum .NET Framework aus. Doch mit NuGet kann der Entwickler mehr erreichen, als nur Bibliotheken in seine Projekte zu integrieren. Der Vortrag zeigt auf, mit welchen Mechanismen die Erstellung von eigenen Pakten gelingt über die Bibliotheken zwischen Projekten geshared werden können, wie die Erstellung dieser Pakete über einen Build-Prozess automatisiert werden können und wie dabei Dinge wie z.B. Versionierung, Verwaltung von Debug-Informationen etc. quasi im Vorbeigehen erledigt werden. Und es wird gezeigt, wie sie ein eigenes NuGet Repository aufbauen. Dieser Vortrag zeigt Schritt für Schritt die Aspekte von NuGet so dass am Ende ein komplettes Einsatzszenario entsteht.","start":"2014-08-16T08:30:00Z","track":".NET-Tools","speaker":"Schissler, Thomas"},{"title":"ATDD – Der Weg zur lebenden Dokumentation?Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Tests sind im Grunde nichts anderes als die Prüfung vorhandener Anforderungen und der damit verbundenen Spezifikation. Im Umkehrschluss, kann diese Kombination aus Soll- und Ist-Beschreibungen als Dokumentation des aktuellen Projektstatus gesehen werden. In Verbindung mit Testautomatisierung wiederum ergibt sich ein tagesaktueller Informationsstand. Zumindest theoretisch, denn um das Ziel der lebenden Dokumentation tatsächlich zu erreichen ist eine gänzlich andere Vorgehensweise bei der Entwicklung notwendig. In dieser Session wird daher darauf eingegangen wie die testgetriebene Entwicklung auf der Ebene der Akzeptanztests realisiert werden kann um eine Testabdeckung zu erzielen die tatsächlich belastbare Aussagen zu lässt. Darüber hinaus wird über die typischen Schwierigkeiten mit der Domänen-Spezifischen-Sprache Gherkin aufgeklärt und einige Anregungen dazu gegeben wie Projekte und Teams aufgebaut sein sollten damit der Einsatz von ATDD bzw. BDD tatsächlich gelingt.","start":"2014-08-16T08:30:00Z","track":"Craftsmanship","speaker":"Lösch, Hendrik"},{"title":"WPF – Deep Data BindingDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Der Vortrag zeigt alle Facetten des Data-Bindings in WPF und stellt auch seltener benutzte Binding-Arten an Beispielen vor.","start":"2014-08-16T08:30:00Z","track":"Desktop","speaker":"Marquardt, Bernd"},{"title":"Verhaltensmuster in der IT- SystementwicklungDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Es gibt klassische Verhaltensmuster in IT-Projekten, die fast überall gelebt und gepflegt werden. Einige dieser Verhaltensmuster sind definitiv erfolgsverhindernded und drohen Projekte in die Katastrophe zu Kippen.Als Teammitglied weiß man oft nicht, ob man lieber Lachen oder Weinen soll, wenn einen diese Verhaltensmuster wieder begegnen. Wir haben uns diesmal für Lachen entschieden. Für den Vortrag haben wir die wichtigsten dieser Muster aufbereitet, die Auswirkungen untersucht und nach Ausstiegsszenarien gesucht. Dieses Wissen hilft ihnen Verhaltensmuster zu erkennen und zu beheben.","start":"2014-08-16T08:30:00Z","track":"Soft Skills","speaker":"Rupp, ChrisFriedrich, Ulrike"},{"title":"HTML5 Video: curing plugin maladies since 2007Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"We'll start with a brief discussion about the history of video on the web, and the circumstances that led to where things are now. We'll then go into the current state of affairs and talk about the current supported feature set (and browsers). We'll then continue on to talk about new features that are gaining adoption and even features that are barely out of spec.","start":"2014-08-16T08:30:00Z","track":"Schnittstellen","speaker":"McClure, Matthew George"},{"title":"Windows Phone <3 UnternehmenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Das Windows Phone wurde selbstverständlich auch für den Einsatz in Unternehmen entworfen. In dieser Session zeigen wir Ihnen, wie Sie Windows Phones mithilfe von Unternehmens-Apps basierend auf .NET und Infrastrukturlösungen wie Windows Intune nahtlos und effektiv in Ihr Unternehmen integrieren können. Denn die schönste Business-App nützt nichts, wenn sie nicht kontrolliert, sicher und wartbar verteilt werden kann – das Stichwort ist Sideloading.","start":"2014-08-16T08:30:00Z","track":"Windows Phone","speaker":"Mayer, BerndBoscolo, Patric"},{"title":"Scrum, Kanban, oder doch beides?Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"In diesem Beitrag, möchte ich meine Erfahrungen und Lehren, aus 3 intensiven Jahren inmitten Kanban, Scrum und einem gesunden Misch der beiden agilen Vorgehensmodellen vorstellen. Die Abläufe, sowie die Vor- und Nachteile jedes einzelnen Modells stehen im Mittelpunkt dieses Vortrags und wie man sie zu einem starken Konstrukt bündelt, das aus beiden Welten das Beste beinhaltet. Zugleich, möchte ich den Entwicklern die Angst nehmen, dass sie durch die Umstellung auf Story-Points und Sprints, zum gläsernen Arbeitnehmer werden. Finden sie in diesem Vortrag heraus, wie sich in den vergangenen Jahren aktiver Nutzung, die Stärken der beiden Frameworks heraus kristallisiert haben und wie sie bei AutoScout24 praktiziert und eingesetzt werden.","start":"2014-08-16T08:30:00Z","track":"Vorgehensmodelle","speaker":"Foukis, Ilias"},{"title":"Nokia X: einfache Portierung von Android-AppsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die Software-Plattform Nokia X basiert auf dem Android Open Source Project (AOSP). Dadurch sind ca. 75% aller Android Apps mit Nokia X Smartphones kompatibel. Falls Anpassungen notwendig sind, können diese in den meisten Fällen innerhalb weniger Stunden implementiert werden – dadurch kann der Markt mit geringem Aufwand maßgeblich vergrößert werden; das Nokia X ist beispielsweise das #1 Smartphone seines Preissegments in Russland oder #3 in Indien. In dieser Session wird eine Einführung zum Nokia X gegeben und danach die verfügbaren Tools zur Analyse und Portierung vorgestellt.","start":"2014-08-16T08:30:00Z","track":"Mobile-Tools","speaker":"Jakl, Andreas"},{"title":"F# im Web und auf dem ClientDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Auf Serverseite haben Sie die freie Auswahl - welche Sprache Sie auch immer bevorzugen, Sie werden ein Webframework finden. Auf der Clientseite sind Sie aber in der Regel auf HTML/CSS/JavaScript angewiesen und speziell die Verbindung zwischen JavaScript und der Serverseite ist nicht immer einfach.\nMittlerweile gibt es einige Möglichkeiten das Problem zu umgehen und Javascript für den Client generieren zu lassen.Ich möchte Ihnen hier zeigen, wie Sie eine komplette Webanwendung mit Hilfe von Websharper komplett in F# entwickeln können.","start":"2014-08-16T09:45:00Z","track":"Sprachen","speaker":"König, Carsten"},{"title":"The Black Art of GUI TestingDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Viel zu oft zeichnen sich Oberflächentests durch die folgenden drei Dinge aus: lange Laufzeiten, Fragilität und einen hohen Aufwand in Konzeption und Wartung. Im Kontext von Web-Apps soll dieser Vortrag zeigen, wie die drei Probleme mit unterschiedlichen Mitteln bekämpft werden können. Den Zuhörerinnen und Zuhörern sollen neben dem großen Ganzen zahlreiche praktische Tipps vermittelt werden, die sie noch am selben Tag in ihren Projekten umsetzen können.","start":"2014-08-16T09:45:00Z","track":"Craftsmanship","speaker":"Thelen, Christoph"},{"title":"Missverständnisse bei der WPF Look & Feel EntwicklungDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mit der Windows Presentation Foundation (WPF) wird eine ursprünglich für den Desktop konzipierte User Interface Technologie aktuell auch immer mehr für industrielle Anwendungen und Maschinensteuerungen eingesetzt. Diese sollen durch ein ansprechendes und auf Maschine und Unternehmen abgestimmtes Look & Feel punkten. Durch die Beschreibungssprache XAML und der Entkopplung zwischen Geschäftslogik und Aussehen (Look), sowie Mikro Interaktionsverhalten (Feel) einer Anwendung, öffnet WPF viele Türen für die Entwicklung eines wiederverwendbaren Look & Feels. Der Vortrag zeigt anhand praktischer Beispiele, wie sich die von Microsoft genutzten Begriffsdefinitionen wie beispielsweise \"Theme\" & \"Skin\" gegeneinander abgrenzen. Zudem werden Best Practices für ein visuell ansprechendes, gut bedienbares und trotzdem wartbares und performantes WPF Look & Feel vorgestellt.","start":"2014-08-16T09:45:00Z","track":"Desktop","speaker":"Keller, Alexander"},{"title":"Test Driven Development.phpDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Unit Testing hat bereits einen weiten Weg hinter sich und so ist es zu unserem Glück heutzutage recht einfach seine Testumgebung aufzusetzen. Dieser Workshop führt Sie in die Grundlagen von Unit Tests ein und zeigt Ihnen außerdem wie man Tests vor dem Code schreibt. Am Ende des Tages werden Sie eine Menge Unit Tests in PHPUnit sowie Ihre ersten Mock Objekte geschrieben haben. Außerdem werden Sie erfahren haben, wie es sich anfühlt, zuerst die Tests und dann den Code geschrieben zu haben.","start":"2014-08-16T08:30:00Z","track":"Websprachen","speaker":"Ketterl, JakobJungowski, Dominik"},{"title":"Agiles Vorgehen in traditionellen ProjektenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Während immer mehr Software- und Beratungshäuser agile Vorgehensmodelle zur Abwicklung von Projekten anwenden, werden sie nach wie vor mit der traditionell geprägten \"Wasserfall\"-Projektkultur auf Kundenseite konfrontiert. In dem Vortrag möchte ich Lösungsansätze erläutern, wie beide Ansätze in Einklang gebracht werden können (wie und in welchem Umfang), und die Investition in traditionelles Projekt Know-how auf Kundenseite, sowie in die Etablierung agiler Prozesse auf Lieferantenseite bewahrt werden. Auch die Frage, wie ich herausfinden kann, welches Projekt überhaupt für eine agile Vorgehensweise geeignet ist, wird beantwortet.  Darüber hinaus werde ich aufzeigen, wie die Teams zusammenarbeiten, das Projekt-Controlling/-Reporting, Metriken und Tools angepasst werden müssen, um in hybriden Projekten bestehen zu können.","start":"2014-08-16T09:45:00Z","track":"Vorgehensmodelle","speaker":"Graegert, Steve"},{"title":"Abenteuer RecruitmentDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Welches sind die Schlüsselkriterien für eine “schnelle Stellenbesetzung“ und “qualitativ richtige“ Personalauswahlentscheidung? Die Session bietet wertvolle Denkanstöße für eine professionelle Gestaltung des Recruitment Prozesses.","start":"2014-08-16T09:45:00Z","track":"Soft Skills","speaker":"Schüller, Julia"},{"title":"Code Generierung mit .NETDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"\"Don't repeat yourself\" ist ein der Grundtugenden von Clean Code. Zu recht, denn mit copy & paste erzeugt man zwar schnell aber ineffizient unwartbare und fehleranfällige Software. Das automatische Erzeugen von ausführbarem Code aus Fachmodellen ermöglicht, wertvollere Software zu erstellen. In dieser Session zeige ich, wie Code Generierung hilft, Abstraktionsstufen zu überwinden, Entscheidungen reproduzierbar zu treffen und trotzdem die Evolvierbarkeit der Software zu gewährleisten. Ein Überblick über Tooling-Ansätze, von den Visual Studio-eigenen T4-Templates bis zu ausgefeilten Sprachwerkzeugen hilft Ihnen, beliebte Fallstricke zu vermeiden - und sich nicht mehr unnötig wiederholen zu müssen.","start":"2014-08-16T09:45:00Z","track":".NET-Tools","speaker":"Jander, Philip"},{"title":"Endlich neue SoftwareDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Viele etablierte und unverzichtbare PHP-Anwendungen sind im objektlosen \"Dark Age\" entstanden, und selbst die mit Symfony 1 oder Zend Framework entstandenen Lösungen warten ungeduldig auf eine Ablöse. Doch wir Entwickler sind unzufrieden, wie gerne hätten wir wieder eine neue, saubere Lösungen. Und auch der Businessmensch möchte, dass wir wieder schneller Lösungen schaffen. Wie man damit umgeht, und wie man mit alter Software trotzdem Businesseite und Entwickler glücklich macht zeigt dieser Talk, mit vielen Einsichten und praktischen Erfahrungen zur Arbeit mit altem Code.","start":"2014-08-16T09:45:00Z","track":"Websprachen","speaker":"Ruprecht, Martin"},{"title":"Vier Stores für eine App: Entwicklung in 60 Min.Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wichtige Bausteine hierfür sind wiederverwendbare Services und vorgefertigte Komponenten. Die von den Azure Mobile Services bereitgestellten Möglichkeiten werden Jan und Marco in dieser Session vorstellen. Nach einer schnellen Einführung in das Azure Portal werden sie das Backend in einfachen Schritten erstellen und weiterentwickeln. Hierbei werden die wichtigsten Punkte von CRUD-Operationen über Authentifizierung und Authorisierung bis hin zur Sourcecodeverwaltung behandelt. In einer weiteren Session werden die beiden zeigen wie die so entstandene Basis einfach in einer Crossplattform-App genutzt werden kann.","start":"2014-08-16T09:45:00Z","track":"Windows Phone","speaker":"Richardson, MarcoSchweda, Jan"},{"title":"Mobile Security: Death to passwordsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"User authentication in mobile applications is a very common and integral use case. Implementing regular passwords is an easy solution for developers but comes with several pitfalls that impair user experience like (re-)entering passwords, the need to create a new unique password or even just the input of personal data on a flaky keyboard while registering a new account. In this talk the security flaws and UX implications of passwords will be discussed and highlighted which different techniques exist that are able to offer a more mobile friendly flow. Highlighting authorization and authentication techniques like OAuth, OpenID Connect and even hardware features like Bluetooth Low Energy this talk will be interesting for anyone who's facing a situation where creating and storing user accounts matters.","start":"2014-08-16T09:45:00Z","track":"Schnittstellen","speaker":"Messerschmidt, Tim"},{"title":"Mobiles E-Learning mit MoodleDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die Open Source E-Learning Software Moodle ist gerüstet für den mobilen Einsatz. Wir zeigen Ihnen, wie Sie Bordmittel mit modernen Web-Technologien kombinieren können um eine bestmögliche Userexperience im mobilen online Lernen erreichen können. Dabei legen wir Wert auf Plattformunabhängigkeit.","start":"2014-08-16T09:45:00Z","track":"Mobile-Tools","speaker":"Kraehe, ThomasHauser, Tobias"},{"title":"Building Rich Media AppsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Windows Azure bietet mit den Media Services eine Komplettlösung für die Videobearbeitung, Videocodierung und Bereitstellung von Multimedia Inhalten in der Cloud. Gerade im professionellen Arbeitsalltag ist die Aufzeichnung bzw. das Live-Streaming z. B. eines Sprint Abschluss Meetings akzeptierter als ein mehrseitiges Protokoll.  Auch ist oftmals ein Video Tutorial aussagekräftiger und einfacher in der Herstellung als ein dickes Handbuch. Im Vortrag wird ein Template vorgestellt welches alle Komponenten zum Aufbau einer eigenen Media App beinhaltet. Unter anderem eine Win8.1 App (C#/WPF), ein zugehöriges Backend für die Verwaltung der multimedialen Inhalte und alle notwendigen Cloud Dienste. Das komplette Quick Start Template steht nach dem Vortrag im Source Code zum Download und zur Integration in eigene Projekte zur Verfügung.","start":"2014-08-16T11:45:00Z","track":"Desktop","speaker":"Weisserth, Tobias"},{"title":"Die JavaScript Engine V8 in .NET AnwendungenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die JavaScript Engine V8, die unter der Federführung von Google entwickelt wird, bietet einen einfachen Weg, das Verhalten einer Anwendungen durch eine leistungsfähige Skriptsprache anpassbar zu gestalten. Ursprünglich für Webanwendungen gedacht, erlaubt das Framework ClearScript auch eine einfache Verwendung in .NET Anwendungen. Diese Session führt in die wichtigsten Konzepte der Nutzung der V8 über ClearScript ein. Dabei werden neben den grundlegenden Verfahren zur Kommunikation zwischen Skript und Anwendung auch Möglichkeiten zur Erweiterungen vorgestellt. Dabei wird die Frage berücksichtigt, wann und in welcher Form Erweiterungen einer Anwendung sinnvoll sind und wie diese Ansätze mit ClearScript und der Script Engine V8 umgesetzt werden können.","start":"2014-08-16T11:45:00Z","track":"Sprachen","speaker":"Zimmermann, Torsten"},{"title":"Mit agilen Praktiken SOLIDe Systeme bauenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Seit einiger Zeit sind agile Entwicklungsprozesse im Mainstream angekommen. Viele Teams entwickeln Software mit agilen Methoden. Doch reicht es, den Prozess umzustellen? Wie sollen wir spät erkannte Anforderungen in unsere Software integrieren, wenn diese nicht flexibel ist? Wie soll ich nach jedem Commit alles integrieren, wenn schon der Build 3 Stunden braucht? Wie sollen wir nach jedem 2-Wochen-Sprint ausliefern, wenn schon das Testen 4 Wochen dauert? Die Erfahrung der letzten Jahre hat gezeigt, dass es vielen Scrum-Teams nicht gelingt, Iterations-Ergebnisse mit ausreichend hoher Qualität zu erstellen.  Zu agiler Entwicklung gehört also mehr, als nur den Prozess umzustellen. Dieser Vortrag zeigt, welche agilen Entwicklungspraktiken helfen, flexible Systeme zu bauen, die leicht änderbar und wartbar sind. Wie sieht der Werkzeugkasten aus, den ein Entwickler im agilen Umfeld benötigt? Welche Techniken und Tools helfen ihm, nach jedem Sprint ein potentiell auslieferbares Produktinkrement zu erstellen?","start":"2014-08-16T11:45:00Z","track":"Craftsmanship","speaker":"Günther, Sven"},{"title":"Führungskompetenz TeamentwicklungDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Was zeichnet eine erfolgreiche Führungskraft aus? Erfolgreiche Führungskräfte haben ein leistungsfähiges und motiviertes Team. In dieser Session wird das Wissen einzelner Teamphasen vermittelt, um so situativ die richtigen Entscheidungen für den Führungsalltag zu treffen und schafft somit den bestmöglichen Rahmen für das Leistungspotential des Teams.","start":"2014-08-16T11:45:00Z","track":"Soft Skills","speaker":"Schüller, Julia"},{"title":"Payment Integration im Multi-Channel UmfeldDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die Grenzen zwischen dem traditionellen Ladengeschäft, E-Commerce und Mobile Commerce verwischen immer mehr. Die Verbraucher erwarten besser integrierte Einkaufsmöglichkeiten, die schnell, konsistent, sicher und jederzeit, überall und mit jedem Gerät verfügbar sind. Um hierbei innovative Lösungen bereitstellen zu können, ist eine technische Infrastruktur gefragt, mit der die verschiedenen Bereiche verzahnt werden können und Themen wie Kartenzahlungen mit Chipkarte und PIN, Authentifizierung von Internet-Usern, cloud-basierte Reportings, QR-Codes, mobile Apps usw. in ein nahtloses Gesamtkonzept gebracht werden können. Der Vortrag zeigt die aktuellen Trends im Multi Channel Payment Umfeld, welche technischen Schnittstellen hierfür zur Verfügung stehen und wie diese integriert werden können.","start":"2014-08-16T11:45:00Z","track":"Schnittstellen","speaker":"Bröking, MarcDangel, Steffen"},{"title":"FAKE: Echt starkes Build für .NET, mit .NETDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"PRE- und POST-Build Events reichen nicht mehr? Dann ist es an der Zeit, mit einem Buildskript die Kontrolle über das Erstellen der Solution zurückzugewinnen. FAKE ist auf gutem Weg, zum zweiten Standard für das Bauen von .net Solutions zu werden. Seine Stärke ist einerseits die Verbindung von deklarativem Buildprozess (wie MSBuild, aber ohne XML) mit einer Programmiersprache - kleine Tasks und Koordinierungslogik schreibt man direkt in F# im Buildscript. Das Prinzip ist gut bekannt unter anderem. von make (BSD/GNU), rake (Ruby) und psake (Power shell). Komplexere und oft verwendete Buildschritte kann man andererseits nahtlos in .NET DLLs auslagern, denn FAKE läuft in der .NET Umgebung und kann daher in jeder .NET Sprache extrem einfach erweitert werden. Nicht, dass letzteres noch oft nötig wäre, denn die Menge der von FAKE unterstützten Funktionen wächst ebenso rasch wie der Kreis der Nutzer. Als Bonus bekommt man ganz nebenbei einen leichten Einstieg in die Sprache F#.","start":"2014-08-16T11:45:00Z","track":".NET-Tools","speaker":"Jander, Philip"},{"title":"Vier Stores für eine App: DeploymentDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Der Schlüssel hierzu lautet: Crossplattform Development! Die Möglichkeit, mit HTML5/CSS und Javascript Apps auf mehreren Plattformen zu veröffentlichen, mutet erst einmal wie der heilige Gral der Kosteneffizienz an. Doch auf dem Weg dorthin, lauern massive Stolpersteine. In dieser zweiten Sessions werden Marco und Jan Ideen geben, wie diese Barrieren durchbrochen werden können. Vom Einsatz der richtigen Tools, über das Konsumieren der erstellten Mobile Services bis hin zur Verwendung von PhoneGap für das deployen, zeigen sie alles was es für eine funktionierende Crossplattform-App braucht. Dabei werden sie auch aufzeigen, wie die Sourcecodeverwaltung optimal mit der Build-Cloud von Adobe PhoneGap zusammenspielt.","start":"2014-08-16T11:45:00Z","track":"Windows Phone","speaker":"Richardson, MarcoSchweda, Jan"},{"title":"TYPO3 Neos - Next Generation CMSDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Das Open Source Enterprise CMS TYPO3 Neos hat im Dezember 2013 das Licht der Welt erblickt. Aber was leistet dieser Newcomer in einer Welt der etablierten Systeme und wie unterscheidet er sich von Mitbewerbern? Welche technischen Komponenten bilden das Fundament und was ist notwendig um möglichst einfach und schnell den Einstieg zu bekommen? Wo sind die Stärken und wo die Schwächen dieses innovativen Systems? Show-Cases bereits realisierter Websites und Portale runden den Vortrag ab. Für Entscheider und Entwickler gleichermaßen geeignet.","start":"2014-08-16T11:45:00Z","track":"Websprachen","speaker":"Lobacher, Patrick"},{"title":"Football, Poker, PM oder: Wir führen Scrum ein!Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die Zahl der agilen Projektteams ist seit der Einführung des \"MSF for Agile Software Development\" Projekttemplates im TFS rasant angestiegen. Doch was ist überhaupt agile Softwareentwicklung und wofür brauchen wir das? Scrum ist eins von vielen agilen Projektmanagementframeworks das mit zunehmender Beliebtheit zum Einsatz kommt. Durch Scrum wird - bei korrekter Anwendung - die Eigenverantwortlichkeit gefördert, Aufwände werden belastbarer geschätzt und in definierten, regelmäßigen Abschnitten wird ein vollständig funktionierendes Produktinkrement fertiggestellt. Einen Überblick darüber, wie all dies funktioniert und was Scrum mit Football und Pokern zu tun hat, zeigt diese kurzweilige Session.","start":"2014-08-16T11:45:00Z","track":"Vorgehensmodelle","speaker":"Jacob, Marcus"},{"title":"Der internationale Markt: Lokalisierung von AppsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mit steigendem Konkurrenzdruck im AppStore wird die Erschließung von Kunden jenseits der Grenzen des eigenen Heimatlands immer wichtiger. Essentiell dafür ist, dass die App die Sprache der Nutzer spricht und sich regionalen Gepflogenheiten anpasst. Dazu gehören neben der reinen Übersetzung von Texten - inklusive Berücksichtigung korrekter Pluralbildung - auch die regionalspezifische Darstellung von Datumsangaben, Beträgen, Mengen usw. Der Vortrag beleuchtet die grundlegenden Überlegungen, die bereits bei der Planung einer App berücksichtigt werden sollten, und zeigt am Beispiel einer Demoapplikation die konkrete Umsetzung mithilfe der von Apple bereitgestellten Frameworks und Techniken sowie einiger darum herum angesiedelter Werkzeuge. Ausgehend von einer rein deutschsprachigen Version wird die App Schritt für Schritt fit für die Welt gemacht. Der Beispielcode läuft unter iOS, die Prinzipien gelten aber für alle Plattformen, sowohl mobil als auch für den Desktop, gleichermaßen.","start":"2014-08-16T11:45:00Z","track":"Mobile-Tools","speaker":"Schneller, Daniel"},{"title":"Unit Testing und Mocking mit Microsoft FakesDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mittlerweile sollte das Microsoft Fakes Isolation Framework den meisten Visual Studio Benutzern bekannt sein. Zumindest seit Microsoft Fakes auf die Premium SKU ausgedehnt hat. Diese Session richtet sich an Interessierte, die bisher noch nicht mit einem Mocking Framework gearbeitet haben und vor der Frage stehen, ob sich der Einsatz von Microsoft Fakes lohnt. Anhand einfacher Beispiele soll gezeigt werden, für welche Anwendungsfälle Fakes geeignet ist und wie es dazu direkt aus Visual Studio heraus genutzt werden kann. Im Zusammenhang mit Unit Tests entfaltet es seine volle Wirkung und dabei muss sogar das .NET Framework im Zweifelsfall die Hosen runterlassen.","start":"2014-08-16T13:00:00Z","track":".NET-Tools","speaker":"Jacob, Christian"},{"title":"SOLIDe Prinzipien des objektorientierten EntwurfsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Das Kürzel SOLID benennt fünf einfache Prinzipien des objektorientierten Entwurfs, die Sie bei der Erstellung wartbarer und langlebiger Software unterstützen. Diese Session bietet eine Einführung in diese Prinzipien und zeigt, wie man mit ihrer Hilfe die Struktur und das Zusammenspiel objektorientierter Modelle wesentlich verbessern kann.","start":"2014-08-16T13:00:00Z","track":"Craftsmanship","speaker":"Traub, Dennis"},{"title":"Monaden durch Beispiele begreifenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wahrscheinlich denken Sie bei Monaden an abstrakte Theorie. Monaden finden sich aber praktisch überall und der Umgang mit ihnen ist in vielen modernen Programmiersprachen ganz einfach.Deshalb möchte Ihnen hier die Welt der Monaden anhand einiger Beispiele näher bringen. Einzige Voraussetzung: Sie lassen sich nicht abschrecken und behalten einen kühlen Kopf!","start":"2014-08-16T13:00:00Z","track":"Sprachen","speaker":"König, Carsten"},{"title":"Definition of Almost DoneDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Im gefühlt dauerhaften Druck des Alltagsgeschäfts neigen Entwicklungsteams dazu Dinge nur zu 90% fertig zu stellen. Wenn diese dann noch als vermeintlich abgeschlossene Arbeit akzeptiert werden, ist das Chaos perfekt. Wo liegen die tatsächlichen Gründe hinter diesem Verhalten und welche Möglichkeiten gibt es den Fokus darauf zu legen, Dinge wirklich fertig zu stellen?","start":"2014-08-16T13:00:00Z","track":"Vorgehensmodelle","speaker":"Jungowski, Dominik"},{"title":"Die eigene App mit dem Cloud AD verbindenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Im Enterprise Bereich ist die Windows-Authentifizierung wohlbekannt und sehr einfach in die eigene Anwendung zu integrieren. Aber welche Möglichkeiten gibt es denn wenn man die eigene Applikation in die Cloud auslagert? Was der \"Facebook-Login\" für den Consumer-Bereich ist, versucht Microsoft mit dem Windows Azure Active Directory den Business-Bereich abzudecken. In dem Vortrag zeige ich, wie man die eigene Anwendung mit dem Azure AD bekannt macht, welche Möglichkeiten es gibt Daten aus dem Azure AD zu beziehen und wie man neue Daten auch hinterlegen kann.","start":"2014-08-16T13:00:00Z","track":"Desktop","speaker":"Mühsig, Robert"},{"title":"Frontend First DevelopmentDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die Möglichkeiten die uns moderne Browser und mobile Geräte geben sind einfach erstaunlich. Wöchentlich lernen woe mit neuen Funktionen quer durch alle möglichen Plattformen umzugehen. Die dunkle Seite dieser schönen Anwendungsentwickler-Welt ist, dass wir uns für jede nur mäßig anspruchsvolle Anwendung, um einen Backend-Service kümmern müssen. Das bedeutet jede Menge Entscheidungen zur Technologie, Architektur und Betrieb zu treffen. Alles machbar, aber immer wieder Schmerzhaft, Aufwändig und Teuer. Wir wollen doch Apps bauen! Wäre es nicht toll, wenn wir den Entwicklungsschwerpunkt zu 100% auf das Frontend legen könnten? Was, wenn wir Apps im Laufe eines Wochenendes bauen und noch am Montag Rechnungen stellen könnten? Kann das alles so einfach programmierbar wie jQuery sein? NoBackend und Frontend First ist Technologie, Programmierung, Architektur und Methodik kombiniert zu einem ganzheitlichen Ansatz zur effizienten Umsetzungen von Web, Desktop und Mobiles Apps.","start":"2014-08-16T13:00:00Z","track":"Websprachen","speaker":"Bild, Mike"},{"title":"Cross-Plattform Mobile mit C#Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Write once, run everywhere? Für Mobilgeräte gibt es unterschiedliche Ansätze, dieses Ziel zu erreichen. Im Rahmen dieses Vortrags wird der spannende Cross-Compile-Ansatz von Xamarin vorgestellt, der es ermöglicht, eine gemeinsame Codebasis für die wichtigsten Plattformen zu pflegen und trotzdem native Oberflächen zu verwenden. Mit Hilfe des MvvmCross-Frameworks soll während des Vortrags in Visual Studio eine App erstellt werden, die Code Sharing bis einschließlich ViewModel ermöglicht und trotzdem native Oberflächen für Android und iOS umsetzt.","start":"2014-08-16T13:00:00Z","track":"Windows Phone","speaker":"Lothrop, Kerry W."},{"title":"Integration von Google+ in iOS- und Android AppsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Diese Session zeigt auf, wie Sie durch den Einsatz von Google+ die Sichtbarkeit und Auffindbarkeit Ihrer App erhöhen können. Anhand von Demos erkläre ich die grundlegenden Google+ Features. Unter anderem demonstriere ich, wie Google+ Cross-Platform Single Sign-On funktioniert, wie Ihre Benutzer einfach Inhalte aus Ihrer mit ihren Circles teilen können (und dabei gleichzeitig neue Benutzer auf ihre App aufmerksam machen) und wie Sie durch den Einsatz von App Activities die Sichtbarkeit Ihrer App in der Google Suche erhöhen.","start":"2014-08-16T13:00:00Z","track":"Schnittstellen","speaker":"Friese, Peter"},{"title":"Installer bauen leicht gemachtDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die schöne neue Welt der Windows 8 Apps macht einem vieles einfacher. Installer müssen nicht mehr per Hand erstellt werden, alles läuft ganz einfach über den Marketplace. Aber was ist mit den Desktop Anwendungen, die wir grade im Businessumfeld tagtäglich entwickeln? Hier sind noch immer einfache bis komplexe Installationsroutinen von Nöten, die zumeist unter Hilfenahme von lizenzpflichtigen Produkten erstellt werden. Dank Windows Installer XML kann dies jedoch auch ganz einfach ohne weitere Lizenzkosten gelöst werden. Das Beste dabei ist, dass ein Installer auf diese Art und Weise als eigenständiges XML basiertes Projekt in die Visual Studio Projektmappe aufgenommen und somit sogar ganz einfach in die Buildprozesse integriert werden kann. Diese Session zeigt wie einfach es ist einen Installer zu erstellen und gibt einen Ausblick auf die Möglichkeiten dieser Technologie.","start":"2014-08-16T14:30:00Z","track":".NET-Tools","speaker":"Jacob, Marcus"},{"title":"Qualitätsmanagement für kleine und mittlere UnternehmenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Kreatives Design, Software-Entwicklung und Qualitätssicherung müssen im Entwicklungsprozess keine Gegensätze sein. Der Vortrag beschäftigt sich damit, wie gerade kleine und mittlere Unternehmen bestehende Standards im Qualitätsmanagement  als Chance nutzen und im praktischen Geschäft umsetzen können. Grundsätzlich lautet die Frage: Verschafft Qualitätsmanagements einem fachlich stark durchmischten Team mit alltäglichem Projektdruck wirklich eine Arbeitserleichterung? Am Beispiel unseres Unternehmens stellen wir die Vorteile und Probleme des Transformationsprozesses dar.","start":"2014-08-16T14:30:00Z","track":"Craftsmanship","speaker":"Radke, MatthisRichter, Matthias"},{"title":"Vorgehen für die Tablet-App-EntwicklungDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Als Entwickler wird man aktuell von verschiedenen mobilen Entwicklungsumgebungen erschlagen. Aber welches Vorgehen eignet sich wann? In diesem Vortrag präsentieren wir drei verschiedene mobile Entwicklungsvorgehen für die Tabletappentwicklung und vergleichen diese aus der Perspektive eines Entwicklers:In einer vorhergehenden Studie wurden dabei eine Beispielapp, eine Tablet CRM-Lösung, umgesetzt. Sowohl die resultierende App, als auch die Entwicklungsumgebungen- und -vorgehen wurden dabei verglichen.","start":"2014-08-16T13:00:00Z","track":"Mobile-Tools","speaker":"Blitz, PatrickHarrer, Sonja"},{"title":"Win 8.1 Apps mit Hardware verbindenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mit Windows 8.1 hat Microsoft uns endlich die Mittel an die Hand gegeben, um Gadgets und selbstgebaute Hardware mit Windows Store Apps zu verbinden. Diese Präsentation zeigt anhand von praktischen Beispielen, wie man Geräte über vorhandene Schnittstellen mit einer Windows Store App ansprechen kann. Des Weiteren soll vorgestellt werden, wie man eigene Hardware mit Hilfe von embedded Rechnern entwickelt und anschließend mit Windows 8.1 verbindet. Der Fokus liegt dabei auf den Kommunikationswegen Bluetooth, USB und NFC. Nachdem bereits im Großen die Kommunikation mit Hardware über Webschnittstellen anhand der Steuerung einer Industrieanlage via Windows 8 App (http://bit.ly/13PkajD) erprobt wurde, erfolgt nun der Test an kleineren Beispielen. Die Projektbreite reicht dabei von kleiner Hardware mit fertigen SDKs über solche mit bestehenden Schnittstellen bis zum „Do it yourself!“ Projekt, bei dem ein Netduino per Bluetooth von einer Windows 8.1 App angesprochen werden kann.","start":"2014-08-16T14:30:00Z","track":"Desktop","speaker":"Witkowski, Alexander"},{"title":"Vom Entwickler zur FührungskraftDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wer als Entwickler Führungskraft werden möchte - oder noch schlimmer - von anderen zu erklärt wird, hat einen langen und schmerzhaften Weg vor sich. Und die Erfolgsquote, das belegen die eigenen Vorgesetzten jeden Tag, ist nicht hoch. Viele gute Pläne und logische Schlussfolgerungen funktionieren in der Praxis nicht mehr, und die kollegiale Unterstützung wird durch Politik ersetzt. Die schönsten instinktiven Fehler, die besten Katastrophen nach Lehrbuch und Methode werden von jemanden vorgestellt, der sie schon alle gemacht hat.","start":"2014-08-16T13:00:00Z","track":"Soft Skills","speaker":"Hartmann, Johann-Peter"},{"title":"Best practices für globale Scrum TeamsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Agile Softwareentwicklung in einem globalen Team ist eine Herausforderung. Häufig gibt es Probleme mit verschiedenen Zeitzonen und der Kulturunterschied stellt oft ein Hindernis dar, um das Projekt zusammen zum Erfolg zu bringen. Was für die einen zum guten Ton gehört, ist für die andere Seite ein Fremdwort. Wie kann man eine globale Architektur kontrollieren und harmonisieren ? Wie synchronisiert man die Requirements zwischen den einzelnen Teams die auch noch jeder richtig verstehen muss ? Der Talk basiert auf Erfahrungen in einem globalen Projekt mit drei Teams in drei Zeitzonen.Auszug:","start":"2014-08-16T14:30:00Z","track":"Vorgehensmodelle","speaker":"Toth, Jürgen"},{"title":"Das Zen des RasenmähensDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Was bewegt Software Entwickler? Wieso sind die beteiligten am Ende eines Projektes häufig unmotiviert, warum werden Zeiten und Termine gerissen, warum sind große Aufgaben besonderer, warum sind kleine Aufgaben schwieriger und was hat das alles mit Rasenmähen zu tun? Ein Talk über Projektmanagement in Entwicklerprojekten, Agiles Projektmanagement und Motivation bei Teams.","start":"2014-08-16T14:30:00Z","track":"Soft Skills","speaker":"Klawonn, Marco"},{"title":"Neue Techniken für Webprojekte einsetzenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Dass es mittlerweile neben Desktop-PCs mit großen Bildschirmen auch allerlei Mobilgeräte mit speziellen Designanforderungen gibt, hat sich mittlerweile herumgesprochen und wird inzwischen als Standard bei Webprojekten vorausgesetzt. Ebenso ist bekannt, dass sich Responsive-Webdesign verschiedenen Formfaktoren automatisch anpasst. Noch nicht so bekannt sind die neuesten Techniken, mit denen man einen Responsive-Design-Workflow heutzutage unterstützen kann. Neue CSS3-Layout-Module wie die Flexbox-Spezifikationen lassen komplexe, flexible Layouts zum Kinderspiel werden und moderne Browser-Devtools können auf Knopfdruck verschiedene Formfaktoren akkurat simulieren. In dieser Session lernen Sie diese und viele andere Techniken rund um Responsive Design kennen, die über den einfachen Einsatz von Media Queries hinausgehen. Die durchgeführten Praxisbeispiele können Sie direkt für Ihre eigenen Projekte nutzen.","start":"2014-08-16T14:30:00Z","track":"Websprachen","speaker":"Kröner, Peter"},{"title":"Noch eine!? – Eine neue Hochsprache für JVM und CLRDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"AL3 ist eine neue Hochsprache für diverse Plattformen, insbesondere aber für .NET und Java. Aufbauend auf den AL1 Assembler, mit dem Bytecode für virtuelle Maschinen erzeugt werden kann, erweitert diese objektorientierte und funktionale Sprache die Möglichkeiten von C# und Java etwa um primitive komplexe und rationale Zahlen, große Arrays mit long-Indizes, Schnittstellenverträge, Einheiten und vieles mehr. Darüber hinaus kann AL3 recht einfach erweitert werden. Dieser Vortrag gibt eine kurze Einführung in AL3, zeigt einige der besonderen Möglichkeiten und demonstriert, wie einfach die Sprache erweitert werden kann.","start":"2014-08-16T14:30:00Z","track":"Sprachen","speaker":"Wiedeking, Michael"},{"title":"Multi Platform Game Development with UnityDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Mit Unity lassen sich 2D und 3D Spiele schnell entwickeln und auf verschiedenen Plattformen ausrollen. In diesem Vortrag zeige ich die Konzepte von Unity, die Integration mit Visual Studio / Mono Develop und erstelle einen kleinen Spieleprototypen der auf Desktops und mobilen Geräten deployed wird.","start":"2014-08-16T14:30:00Z","track":"Windows Phone","speaker":"Parys, Dariusz"},{"title":"Plug in and play – XING2go für EntwicklerDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Soziale Netzwerke bergen ungeahnte Potenziale, aus denen Software-Entwickler geniale Anwendungen erstellen können. Und nicht nur das: Auch zur Bekanntmachung der eigenen App oder Web-Plattform eignen sich soziale Netzwerke in einzigartiger Weise. Der virale Effekt, den soziale Netzwerke ermöglichen, ist inzwischen ein wichtiger Schlüssel zum Erfolg. Das professionelle Netzwerk XING bietet Entwicklern sowohl eine API als auch „Social Plugins“, mit denen die Reichweite von Web-Plattformen erweitert werden. Plugins sind so gestaltet, dass sie das Leben von Entwicklern leicht machen: Sie bestehen aus einem JavaScript-Code, den man einfach nur in seine Webseite einfügen muss, um die entsprechende Funktion nutzen zu können. In dieser Präsentation werden wir darüber sprechen, wie Social Plugins Ihnen zugute kommen können. Sie erhalten Einblicke in Erfahrungen, Best Practices sowie interessante Anwendungsfälle. Wir werden mit einem kurzen „Live Coding“ abschließen, in dem Sie sehen können, wie einfach die Integration eines Social Plugins von XING ist.","start":"2014-08-16T14:30:00Z","track":"Schnittstellen","speaker":"Fink, Dagmar"},{"title":"Zukunft entwickeln und technologisch zaubern - wie Hardware, Software und Cloud zusammenfindenDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"„Jede hinreichend fortschrittliche Technologie ist von Magie nicht zu unterscheiden.\", meinte Arthur C. Clarke und schuf damit ein Mantra der Technologiegesellschaft. In diesem Vortrag werfen wir gemeinsam einen Blick auf die Bausteine mit denen wir heute schon ein wenig \"zaubern\" können und spannen einen Bogen über aktuelle Entwicklungen rund um Hardware, Software und Cloud.","start":"2014-08-16T15:45:00Z","track":"","speaker":"Primbs, Dirk"},{"title":"Neue Techniken für Responsive DesignDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Dass es mittlerweile neben Desktop-PCs mit großen Bildschirmen auch allerlei Mobilgeräte mit speziellen Designanforderungen gibt, hat sich mittlerweile herumgesprochen und wird inzwischen als Standard bei Webprojekten vorausgesetzt. Ebenso ist bekannt, dass sich Responsive-Webdesign verschiedenen Formfaktoren automatisch anpasst. Noch nicht so bekannt sind die neuesten Techniken, mit denen man einen Responsive-Design-Workflow heutzutage unterstützen kann. Neue CSS3-Layout-Module wie die Flexbox-Spezifikationen lassen komplexe, flexible Layouts zum Kinderspiel werden und moderne Browser-Devtools können auf Knopfdruck verschiedene Formfaktoren akkurat simulieren. In diesem Workshop lernen Sie diese und viele andere Techniken rund um Responsive Design kennen, die über den einfachen Einsatz von Media Queries hinausgehen. Die durchgeführten Praxisbeispiele können Sie direkt für Ihre eigenen Projekte nutzen.","start":"2014-08-17T07:00:00Z","track":"","speaker":"Kröner, Peter"},{"title":"TFS & Java – Ein SDK, das Türen öffnetDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Nicht nur mit der Bereitstellung eines entsprechenden Eclipse Plugins hat Microsoft den TFS für den Zugriff aus der Java-Welt geöffnet. Vielmehr erlaubt das dabei entstandene SDK die Einbindung und Ansteuerung der mit dem TFS verbundenen Dienste. Diese Session klärt anhand einer Realimplementierung, wie das Java SDK für TFS verwendet werden kann, welchen Funktionsumfang es bietet und welche Unterschiede es noch zu seinem SDK-Bruder aus der .Net-Welt gibt.","start":"2014-08-16T14:30:00Z","track":"Mobile-Tools","speaker":"Israel, DennyWilk, Thomas"},{"title":"Backend, Website und App in einem TagDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Am Beispiel eines Spiels wird im Rahmen des Workshops ein kompletter App/Website Entwicklungsprozess abgearbeitet. Nach einer Schilderung des Problems werden Screens designed. Basierend auf den abzubildenden Daten wird ein objektorientiertes Datenmodell erstellt und unter Verwendung von Backend as a Service umgesetzt. Im Anschluss werden eine Android-App und eine Website (HTML und Javascript) erstellt, die mittels SDKs auf die Daten des Backends zugreifen. Ziel ist es, dass am Ende des Tages jeder Workshopteilnehmer ein funktionsfähiges Spiel basierend auf dem Prinzip von „4 Bilder 1 Wort“ umgesetzt hat.","start":"2014-08-17T07:00:00Z","track":"","speaker":"Michel, PhilippKohl, Dr. Lutz"},{"title":"Introduction to Symfony2Developer Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Die Teilnehmer lernen die Grundlagen von Symfony kennen, um in der Folge ihre ersten eigenen Anwendungen mit dem Framework entwickeln zu können. An einem einzigen Tag bieten wir einen Rundgang durch alle gängigen Features, von der Installation und Konfiguration zur Abarbeitung eines Requests. Wir stellen Routing und Templating vor, und definieren erste eigene Formulare. Voraussetzungen: Dies ist ein Workshop für Einsteiger in Symfony. Es sind keine Vorkenntnisse im Framework selbst erforderlich. Allerdings sollten die Teilnehmer solide Grundkenntnisse im objektorientierten Arbeiten mit PHP mitbringen.","start":"2014-08-17T07:00:00Z","track":"","speaker":"Hucks, Andreas"},{"title":"Enterprise-Webanwendungen mit Ext JS / EXT.NETDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"\"Sicher kennen Sie leichtgewichtige UI bzw. MVVM-Frameworks wie Knockout oder AngularJS. Doch was bietet die alternative Seite? Welche Schätze gibt es in puren 1,42 MB JavaScript-Quellcode zu entdecken?Lernen Sie in diesem Workshop das universelle Framework Ext JS und den .NET Wrapper EXT.NET kennen. Johannes Hoppe erläutert die konsequente Umsetzung bekannter Patterns im ExtJS Core. Sehen Sie, wie man mit über 100 Komponenten eine stringente Oberfläche gestalten kann. Dieser Workshop behandelt im Detail die flexible Client-Server Kommunikation über \"Proxys\" & \"Stores\", die Möglichkeiten zum Theming und Layout-Management sowie die Entwicklung eigener Plugins und Komponenten. Es wird ASP.NET MVC, Razor und das Framework EXT.NET (welches Ext JS als Nuget-Paket zur Verfügung stellt) verwendet. Das Setup basiert somit auf .NET, die eigentlich Programmierung geschieht jedoch zum Großteil direkt in JavaScript. Der Workshop richtet sich an alle Teilnehmer, welche mit HTML5 und JS vertraut sind.\"","start":"2014-08-17T07:00:00Z","track":"","speaker":"Hoppe, Johannes"},{"title":"High performance websitesDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Kurze Antwortzeiten sind im Web das Wichtigste - nicht nur für Online-Shops. Aber was tun, wenn die Performance nicht ausreicht? Mehr und leistungsfähige Hardware kaufen? In die Cloud migrieren? Eine weitere Cache-Schicht einführen oder die Schuld auf die überforderte Datenbank schieben? Alles mögliche Optionen, aber bevor Sie Hardware-Hersteller und Provider glücklich machen, sollten Sie vielleicht ein mal einen Blick auf Ihre Software-Architektur werfen! In diesem Workshop lernen die Teilnehmer, wie eine hoch-performante Software- und System-Architektur aussehen kann, mit der man vom einzelnen Server bis hin in die Cloud problemlos skalieren kann.","start":"2014-08-17T07:00:00Z","track":"","speaker":"Priebsch, StefanBlankerts, Arne"},{"title":"Test Driven Development in der PraxisDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Wer hat noch nicht von Test Driven Development gehört. Dieses unvergleichlich tolle Vorgehen, das Architekturen vereinfacht, die Produktivität steigert und dabei den Spaß an der Entwicklung fördert. Versucht man es dann jedoch in der Praxis einzusetzen, ergibt sich nicht selten Ernüchterung. Aus diesem Grund geht dieser Workshop näher auf die Hintergründe von TDD und agiler Softwareentwicklung ein. So führt er kurz in das Thema ein und zeigt anschließend unterschiedliche Ausprägungen des Vorgehens, samt Vergleich derer Vor- und Nachteile sowie Praxistauglichkeit. Ziel des Workshops ist es, dass Sie am Ende selbst entscheiden können wie viel TDD wirklich gut für Ihr Projekt ist und welchen Aufwand Sie tatsächlich dafür in Kauf nehmen wollen. Der Workshop ist sowohl für TDD-Anfänger geeignet als auch für Personen, die eine andere Sichtweise auf das Vorgehen erhalten wollen.","start":"2014-08-17T07:00:00Z","track":"","speaker":"Lösch, Hendrik"},{"title":"Eventsourcing: Blackbox im EigenbauDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Statt nur den Zustand eines Datums festzuhalten, erfasst das Eventsourcing jede Veränderung. Damit ist eine Historie schon eingebaut und eine Undo-Funktion eine Sache von wenigen Zeilen Code. Im Workshop entsteht eine Blackbox, die Daten aufnimmt. Zwei Apps greifen auf diese dann zu.","start":"2014-08-17T07:00:00Z","track":"","speaker":"Westphal, Ralf"},{"title":"MVVM - Eine EinführungDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"MVVM - das ist ein Begriff, den jeder Entwickler einer Benutzerschnittstelle schon einmal benutzt hat. In diesem Workshop lernen Sie an mehreren Bespielen Schritt für Schritt die Grundlagen einer MVVM-Anwendung mit WPF. Nach einer Einführung (DataBinding, INotifyChanged, DataTemplates, ObservableCollection,...) wird das MVVM-Pattern in verschiedenen Ausprägungen besprochen. Hierzu gehören auch Dialoge, Nebenläufigkeit, Parameterübergabe, Unit-Tests usw.","start":"2014-08-17T07:00:00Z","track":"","speaker":"Marquardt, Bernd"},{"title":"Team Foundation Server für kleine Entwickler-TeamsDeveloper Week in Social MediaAussteller & SponsorenInfos anfordernMedienpartner","description":"Der Team Foundation Server von Microsoft hilft Entwickler-Teams von groß bis klein den Überblick zu behalten um sich auf das wesentliche, nämlich das Projekt, fokussieren zu können. Allerdings scheuen gerade kleinere Teams oft die Mühe den TFS einzurichten. Dieser Workshop gibt eine Starthilfe für alle „kleinen“ Teams – wobei es keine Rolle spielt ob diese in einer Fünf-Mann-Entwicklerbude, oder in einem Großkonzern, beheimatet sind. Bringen Sie Ihre Fragen gerne mit! \nAngesprochene ZielgruppenDieser Ein-Tages-Workshop ist genau das richtige für Sie, wenn…\nZieleFolgende Fragen werden im Workshop beantwortet: \nVermittelte Inhalte Im Rahmen des Workshops erfahren die Teilnehmer:Weitere Themen am Rande:Voraussetzungen an die Teilnehmer","start":"2014-08-17T07:00:00Z","track":"","speaker":"Loje, Neno"}]